var questions = [
  {
    q: "《一千種神奇藥草及蕈類》的作者是誰？",
    a: "費麗·斯波兒"
  },
  {
    q: "《初級變形指南》的作者是？",
    a: "愛莫瑞·思為奇 "
  },
  {
    q: "《阿不思·鄧不利多的生平與謊言》是誰的代表作？",
    a: "麗塔·史譏"
  },
  {
    q: "《哈利波特與密室》中沒被石化的是誰？",
    a: "愛哭鬼麥朵"
  },
  {
    q: "《為消遣和盈利而飼養火龍》中建議用什麼餵養新出生的龍？",
    a: "白蘭地混雞血"
  },
  {
    q: "《黑暗力量：自衛指南》的作者是誰？",
    a: "昆丁·特林堡"
  },
  {
    q: "《預言家日報》上鄧不利多的訃告是誰寫的？",
    a: "艾飛·道奇"
  },
  {
    q: "《預言家日報》的記者麗塔·史譏能變成什麼？",
    a: "甲蟲"
  },
  {
    q: "《霍格華茲，一段校史》的作者是？",
    a: "芭蒂達·巴沙特(巴蒂達·巴沙特)"
  },
  {
    q: "《魔法史》的作者是誰?",
    a: "芭蒂達·巴沙特(巴蒂達·巴沙特)"
  },
  {
    q: "「甘普基本變形法則」一共有幾條例外法則?",
    a: "5條"
  },
  {
    q: "「甘普基本變形法則」五大例外中的第一項是什麼？",
    a: "不可能憑空變出美味佳"
  },
  {
    q: "1792年三巫鬥法大會中什麼生物橫衝直往而使三位裁判受傷？",
    a: "雞蛇"
  },
  {
    q: "1985-1986學年，誰帶領葛來分多魁地奇球隊贏得了魁地奇學院杯？",
    a: "查理‧衛斯理"
  },
  {
    q: "1991年誰在霍格華茲教草藥學？",
    a: "斯普勞特教授"
  },
  {
    q: "1994年的魁地奇世界盃得主是誰?",
    a: "愛爾蘭隊"
  },
  {
    q: "1994年魁地奇世界盃決賽時，誰召喚出了黑魔標記？",
    a: "小巴堤‧柯羅奇"
  },
  {
    q: "1997年佛地魔控制下的魔法部內，大廳雕像上寫著什麼？",
    a: "魔法即強權(魔法即是力量)"
  },
  {
    q: "1997年英國魔法部倒臺前的部長是？",
    a: "盧夫昆爵"
  },
  {
    q: "1997年霍格華茲的黑魔法防禦術教授由誰擔當？",
    a: "艾米克‧卡羅"
  },
  {
    q: "1加隆等於多少西可?",
    a: "17"
  },
  {
    q: "1加隆等於多少納特？",
    a: "493"
  },
  {
    q: "1西可等於多少納特？",
    a: "29"
  },
  {
    q: "一件趣事，學生時期隆巴頓教授的幻形怪形態是什麼？",
    a: "石內卜教授"
  },
  {
    q: "一年級時，妙麗‧格蘭傑裝在瓶子裡的火焰是什麼顏色的？",
    a: "藍色"
  },
  {
    q: "一次阿茲卡班越獄事件中，誰嚇得胖夫人逃出了畫框？",
    a: "天狼星·布萊克"
  },
  {
    q: "一次魁地奇比賽中，哈利·波特骨折後誰給他使用了生骨靈？",
    a: "龐芮夫人"
  },
  {
    q: "一段往事，誰殺了格雷女士?",
    a: "血腥男爵"
  },
  {
    q: "一個有趣的問題，先有火焰，還是先有鳳凰？",
    a: "循環往復，沒有起點"
  },
  {
    q: "一群木精被叫做什麽？",
    a: "一個分支"
  },
  {
    q: "七個波特之戰中是因為施放什麼咒語才被發現？",
    a: "繳械咒"
  },
  {
    q: "二年級時，是誰在女生盥洗室外的牆上寫下「與繼承人為敵者，警惕！下一個就是你們，麻種！」的？",
    a: "金妮"
  },
  {
    q: "二年級魔法史會教授中世紀歐洲巫師集會/會議與哪個大會",
    a: "1289國際巫師大會"
  },
  {
    q: "人們能從意若思鏡中看到什麼?",
    a: "最渴望的事物"
  },
  {
    q: "人們常常把黑妖精誤認為什麼？",
    a: "小仙子"
  },
  {
    q: "人馬翡冷翠曾在霍格華茲教授哪一門課程？",
    a: "占卜學"
  },
  {
    q: "人魚有時會飼養什麽神奇生物作爲寵物？",
    a: "滾帶落"
  },
  {
    q: "人頭獅身蠍尾獸在進食時發出什麼聲音?",
    a: "一聲低吟"
  },
  {
    q: "三人組逃亡時，是在誰的幫助下拿到葛來分多寶劍的?",
    a: "賽佛勒斯‧石內卜"
  },
  {
    q: "三巫鬥法大賽中使用的龍不包括下列哪一種？",
    a: "挪威脊背龍(挪威脊椎龍)"
  },
  {
    q: "三巫鬥法大賽中誰與哈利‧波特一同觸碰到獎盃？",
    a: "西追‧迪哥里"
  },
  {
    q: "三巫鬥法大賽每幾年舉辦一次？",
    a: "5"
  },
  {
    q: "三巫鬥法大賽的第一個項目中，花兒挑戰了什麽龍？",
    a: "威爾士綠龍"
  },
  {
    q: "三巫鬥法大賽的第一個項目中，哈利·波特挑戰了什麼龍？",
    a: "匈牙利角尾龍"
  },
  {
    q: "三巫鬥法大賽的第一個項目中，喀浪挑戰了什麼龍？",
    a: "中國火球龍"
  },
  {
    q: "三巫鬥法大賽的第一個項目中，塞德里克挑戰了什麼龍？",
    a: "瑞典短鼻龍"
  },
  {
    q: "三巫鬥法大賽的聖誕舞會上，花兒·德拉庫爾(花兒·戴樂古)的舞伴是誰？",
    a: "羅傑·戴維斯"
  },
  {
    q: "三巫鬥法大賽前，誰綁架了瘋眼穆迪？",
    a: "小巴堤·柯羅奇(小巴蒂·克勞奇)"
  },
  {
    q: "三巫鬥法大賽第一關，誰給了哈利波特10分？",
    a: "盧多·巴格曼"
  },
  {
    q: "三巫鬥法大賽第二個項目誰變成了鯊魚？",
    a: "維克多·喀浪"
  },
  {
    q: "三巫鬥法大賽最後一場比賽中，人面獅身獸給哈利出的謎題的答案是什麼?",
    a: "蜘蛛"
  },
  {
    q: "三巫鬥法大賽幾年舉行一次？",
    a: "5"
  },
  {
    q: "三巫鬥法大賽期間誰邀請了妙麗參加舞會？",
    a: "維克多·喀浪"
  },
  {
    q: "三巫鬥法大賽舞會上，哈利的舞伴是誰？",
    a: "芭蒂·巴提"
  },
  {
    q: "三巫鬥法大賽舞會上，哪支樂隊進行了表演？",
    a: "古怪姊妹"
  },
  {
    q: "三把掃帚酒吧的女主人是誰?",
    a: "羅斯默塔女士"
  },
  {
    q: "三把掃帚的老闆娘是誰?",
    a: "羅斯默塔女士"
  },
  {
    q: "三根掃帚酒吧的老闆是誰？",
    a: "羅梅塔夫人"
  },
  {
    q: "三強爭霸賽的第一個項目中，花兒挑戰了什麼龍？",
    a: "威爾士綠龍"
  },
  {
    q: "三頭巨犬毛毛守護的東西是什麼？",
    a: "魔法石"
  },
  {
    q: "三頭巨犬毛毛的弱點是什麼？",
    a: "聽到音樂就會入睡"
  },
  {
    q: "下列人物中，誰的頭髮會隨心情變色？",
    a: "小仙女．東施"
  },
  {
    q: "下列人物中，誰曾擔任過霍格華茲麻瓜研究的老師？",
    a: "阿萊克托·卡羅(艾朵·卡羅)"
  },
  {
    q: "下列人物中哪一個不是劫盜地圖的制作者？",
    a: "亞瑟·衛斯理"
  },
  {
    q: "下列人物中誰不是哈利·波特的同學？",
    a: "花兒·德拉庫爾(花兒·戴樂古)"
  },
  {
    q: "下列四人中，誰是在魔法部登記的合法阿尼瑪格斯？",
    a: "麥米奈娃"
  },
  {
    q: "下列四人中，誰曾經試圖對哈利使用愛情魔藥？",
    a: "羅咪·凡"
  },
  {
    q: "下列物品中，哪種不是衛氏巫師法寶店的商品？",
    a: "酷酸果"
  },
  {
    q: "下列物品中哪一個不是衛氏巫師法寶店的產品？",
    a: "伸縮眼"
  },
  {
    q: "下列物品中哪一個不屬於魁地奇裝備？",
    a: "看守手的籃筐"
  },
  {
    q: "下列哪一位不是霍格華茲的創始人?",
    a: "海蓮娜·雷文克勞"
  },
  {
    q: "下列哪一個不屬於神聖二十八族(純血家族聯盟)？",
    a: "格蘭傑"
  },
  {
    q: "下列哪一個詞不適合描述海格的狗––牙牙？",
    a: "勇敢"
  },
  {
    q: "下列哪一家店沒有開在斜角巷？",
    a: "三把掃帚酒吧"
  },
  {
    q: "下列哪一種不是常見的大釜材料?",
    a: "鎳"
  },
  {
    q: "下列哪一種不屬於巫師貨幣？",
    a: "多布隆"
  },
  {
    q: "下列哪一種甜點會把舌頭燒出一個洞?",
    a: "酷酸果"
  },
  {
    q: "下列哪本書是魔法界的著名漫畫？",
    a: "《瘋麻瓜馬丁·米格冒險記》"
  },
  {
    q: "下列哪個人不是雷文克勞學院的學生？",
    a: "金妮·衛斯理"
  },
  {
    q: "下列哪個不是衛斯理雙胞胎的發明？",
    a: "變熱假加隆"
  },
  {
    q: "下列哪個房間不屬於英國魔法部神秘事務司?",
    a: "憎恨廳"
  },
  {
    q: "下列哪個家族不住在凱奇波區奧瑞特街附近？",
    a: "隆巴頓家"
  },
  {
    q: "下列哪種生物不住在黑湖中?",
    a: "尼斯湖水怪"
  },
  {
    q: "下列哪種生物不是龍？",
    a: "芬蘭噴火獸"
  },
  {
    q: "下列哪種生物要主動要求被視為野獸？",
    a: "人馬"
  },
  {
    q: "下列哪種奇獸生性高傲，被有禮貌地對待才不會生氣？",
    a: "鷹馬"
  },
  {
    q: "下列哪種魔法界出版物中談及過雙角獸(犄角獸)？",
    a: "《謬論家》"
  },
  {
    q: "下列與天狼星·布萊克無血緣關係的是?",
    a: "道夫·雷斯壯(羅道夫斯·萊斯特蘭奇)"
  },
  {
    q: "下列選項中，最愛搗蛋的是誰？",
    a: "皮皮鬼"
  },
  {
    q: "下列選項中哪一個不屬於山怪類型？",
    a: "橋"
  },
  {
    q: "下列選項中哪個不是伏地魔的魂器?",
    a: "老魔杖"
  },
  {
    q: "下列選項中哪個不是佛地魔的分靈體？",
    a: "接骨木魔杖"
  },
  {
    q: "下列選項中誰不是劫盜地圖的創造者？",
    a: "瘋眼"
  },
  {
    q: "下面哪一項是阿不思‧鄧不利多的著名學術成就？",
    a: "發現龍血的十二種用途"
  },
  {
    q: "大家知道飛七的貓叫什麼名字嗎？",
    a: "拿樂絲太太"
  },
  {
    q: "大家知道海格教授的粉紅色雨傘裡隱藏著什麼？",
    a: "他的舊魔杖"
  },
  {
    q: "大家常去斜角巷光顧的貓頭鷹郵局叫什麼名字？",
    a: "(咿啦)貓頭鷹郵局"
  },
  {
    q: "大戰後誰回到霍格華茲完成七年級的學業？",
    a: "妙麗·格蘭傑"
  },
  {
    q: "小天狼星·布萊克的另一個暱稱是什麼？",
    a: "大腳板(塞鼻子)"
  },
  {
    q: "小天狼星·布萊克的外號有人知道嗎？",
    a: "獸足"
  },
  {
    q: "小天狼星布萊克的魔杖是什麼材質?",
    a: "橡樹"
  },
  {
    q: "小天狼星在誰的幫助下進入了葛來分多塔樓？",
    a: "歪腿"
  },
  {
    q: "小巴堤‧柯羅奇的標誌動作是什麼？",
    a: "吐舌頭"
  },
  {
    q: "小仙女·東施有什麼特殊的魔法能力？",
    a: "變形師"
  },
  {
    q: "小仙女·東施的頭髮一般是什麼顏色？",
    a: "泡泡糖粉"
  },
  {
    q: "小獨角獸寶寶是什麼顏色的？",
    a: "金色"
  },
  {
    q: "不赦咒不包刮以下哪一個咒語？",
    a: "空空，遺忘"
  },
  {
    q: "什麼不是衛斯理雙胞胎的發明？",
    a: "變熱假加隆"
  },
  {
    q: "什麼毛茸茸的東西高興時發出嗡嗡聲，還喜歡把長舌頭伸到巫師的鼻子裡？",
    a: "胖胖球"
  },
  {
    q: "什麼可以讓魔鬼網的藤蔓停止不動？",
    a: "強光"
  },
  {
    q: "什麼生物以人腦為為食，並幫助紐特·斯卡曼德逃離了美國魔法國會？",
    a: "惡閃鴉"
  },
  {
    q: "什麼生物只有面對過死亡的人才能看見？",
    a: "騎士墮鬼馬"
  },
  {
    q: "什麼生物的皮比龍還堅硬，而且可以擋住大部分魔法？",
    a: "紫角獸"
  },
  {
    q: "什麼生物的背部覆蓋著海葵般的觸鬚？",
    a: "海葵鼠"
  },
  {
    q: "什麼生物看起來像由一縷煙霧組成，提著燈籠，會把旅行的人引入泥沼？",
    a: "哼即砰"
  },
  {
    q: "什麼生物能在〝最黑暗、最骯髒的地方〞被找到？",
    a: "催狂魔"
  },
  {
    q: "什麼生物被認為是奇獸飼育學課上最無聊的生物？",
    a: "黏巴蟲"
  },
  {
    q: "什麼生物會以人最害怕的形態出現？",
    a: "幻形怪"
  },
  {
    q: "什麼行為會導致魔法運輸部對無此證件的巫師進行懲罰?",
    a: "現影術"
  },
  {
    q: "什麼奇獸可以產生引人傷感的糖蜜?",
    a: "哭蜜蟲"
  },
  {
    q: "什麼奇獸啟蒙了紐特？",
    a: "紐特母親養的鷹馬"
  },
  {
    q: "什麼東西可以讓你免受魔蘋果的傷害？",
    a: "耳罩"
  },
  {
    q: "什麼東西能重現記憶？",
    a: "儲思盆"
  },
  {
    q: "什麼物品可以檢測出隱匿的魔法物品或隱藏咒?",
    a: "誠實探測器"
  },
  {
    q: "什麼物品會在不懷好意的人接近時響起來？",
    a: "測奸器"
  },
  {
    q: "什麼物品會在葛來分多人危急時出現？",
    a: "葛來分多寶劍"
  },
  {
    q: "什麼物品會顯示人們心中最深的渴望？",
    a: "意若思鏡"
  },
  {
    q: "什麼物種自願被認作為野獸？",
    a: "人馬"
  },
  {
    q: "什麼是給魔蘋果換盆時的必要道具？",
    a: "耳罩"
  },
  {
    q: "什麼紙牌遊戲在霍格華茲很受歡迎？",
    a: "爆炸牌"
  },
  {
    q: "什麼草藥有強大的治癒效果?",
    a: "白鮮"
  },
  {
    q: "什麼植物在受到刺激時會噴出臭樹汁?",
    a: "惡人掌"
  },
  {
    q: "什麼黑暗的人工製品能在黑暗中提供光明但只能給它的持有者？",
    a: "光榮之手"
  },
  {
    q: "什麼黑魔法物品是盜賊之友？",
    a: "光榮之手"
  },
  {
    q: "什麼遊戲與麻瓜的彈子遊戲（打彈珠）類似？",
    a: "高布石(多多石)遊戲"
  },
  {
    q: "什麼導致麥教授曾被送去聖蒙果魔法疾病與傷害醫院？",
    a: "她被四發昏擊咒擊中"
  },
  {
    q: "什麼樣的人才能看的到騎士墜鬼馬？",
    a: "目睹過死亡"
  },
  {
    q: "什麼魔法生物喜歡閃亮的東西?",
    a: "玻璃獸"
  },
  {
    q: "什麼魔法物品可以用於製造長生不老藥？",
    a: "魔法石"
  },
  {
    q: "什麼魔法物品用於挑選三巫鬥法大賽選手？",
    a: "火盃"
  },
  {
    q: "什麽植物在受到刺激時會噴出臭汁？",
    a: "惡人掌"
  },
  {
    q: "仇敵鏡的作用？",
    a: "顯示你的敵人正在逼近"
  },
  {
    q: "分類帽最開始是誰的帽子？",
    a: "高錐客·葛來分多"
  },
  {
    q: "分類帽裡能得到什麼？",
    a: "葛來分多寶劍"
  },
  {
    q: "化獸師形態下的天狼星·布萊克被稱為獸足或什麼？",
    a: "傷風(塞鼻子)"
  },
  {
    q: "天狼星·布萊克在阿茲卡班監獄關了幾年？",
    a: "12年"
  },
  {
    q: "天狼星·布萊克在魔法部哪個部門的戰役中被貝拉・雷斯壯殺死？",
    a: "神秘部門"
  },
  {
    q: "天狼星·布萊克來自哪個學院？",
    a: "葛來分多"
  },
  {
    q: "天狼星·布萊克的外號有人知道嗎？",
    a: "獸足"
  },
  {
    q: "天狼星·布萊克的別稱？",
    a: "獸足"
  },
  {
    q: "天狼星·布萊克的阿尼瑪格斯（化獸師）是什麼動物？",
    a: "黑色大狗"
  },
  {
    q: "天狼星·布萊克的家族座右銘？",
    a: "永遠純淨(永遠純潔)(永遠純粹)"
  },
  {
    q: "天狼星·布萊克的祖宅位置在哪裡？",
    a: "古里某街十二號"
  },
  {
    q: "天狼星·布萊克是從什麼地方知道彼得·佩迪魯的行蹤？",
    a: "預言家日報"
  },
  {
    q: "天狼星·布萊克騎著什麼動物逃離了抓捕?",
    a: "鷹馬"
  },
  {
    q: "巴嘴是什麼生物？",
    a: "鷹馬"
  },
  {
    q: "幻形怪在面對路平教授時變成了什麼？",
    a: "滿月"
  },
  {
    q: "幻影鬼(隱匿怪)是幻影猿與誰結合的後代？",
    a: "惡鬼"
  },
  {
    q: "日記中佛地魔的記憶湯姆‧馬沃羅‧裡德爾讓空中他自己的名字變換了位置，形成一句話，它是?",
    a: "我是佛地魔"
  },
  {
    q: "比爾·衛斯理在古靈閣的職位是什麼？",
    a: "解咒員"
  },
  {
    q: "水仙球根粉末加入什麼植物的浸液會得到一飲活死水？",
    a: "艾草"
  },
  {
    q: "水仙球根粉末加入苦艾汁浸液會得到什麼？",
    a: "一飲活死水"
  },
  {
    q: "水蠟樹街上出現了多少隻催狂魔襲擊哈利和達力?",
    a: "2"
  },
  {
    q: "火螃蟹和人面蠍尾獅交配後會得到什麼？",
    a: "爆尾釘蝦"
  },
  {
    q: "火螃蟹的殼上覆蓋著什麼？",
    a: "寶石"
  },
  {
    q: "世界上一共有幾所魔法學校？",
    a: "11"
  },
  {
    q: "丙斯教授在霍格華茲教哪一門課程?",
    a: "魔法史"
  },
  {
    q: "以下四人誰沒有參加過三巫師鬥法大賽？",
    a: "弗雷"
  },
  {
    q: "以下四個人物誰不是化獸師？",
    a: "納西莎·馬份 (水仙·馬份)"
  },
  {
    q: "以下哪一本書是哈利波特一年級書單沒有的？",
    a: "《基礎魔藥學》"
  },
  {
    q: "以下哪一位是榮恩‧衛斯理在四年級時聖誕舞會上的舞伴？",
    a: "芭瑪‧芭提 (帕德瑪‧佩蒂爾)"
  },
  {
    q: "以下哪一位能和哈利·波特一樣能看到騎士墮鬼馬呢？",
    a: "露娜·羅古德"
  },
  {
    q: "以下哪一個學生跟哈利不是同級？",
    a: "柯林‧克利維 (科林‧克裡維)"
  },
  {
    q: "以下哪本書不是吉德羅·洛哈要求的教科書？",
    a: "《與無臉妖同遊》"
  },
  {
    q: "以下哪本書不是吉德羅洛哈要求的教科書？",
    a: "與無臉妖同船旅行"
  },
  {
    q: "以下哪個人物不是阿尼瑪格斯？",
    a: "娜吉妮"
  },
  {
    q: "以下哪個不是佛地魔復活魔藥所需要的藥材？",
    a: "自身的毛髮"
  },
  {
    q: "以下哪個不是阿不思鄧不利多曾用過的辦公室密語？",
    a: "南瓜汁"
  },
  {
    q: "以下哪個頭銜或身份不曾被哈利‧波特擁有過？",
    a: "S.P.E.W財務總管"
  },
  {
    q: "以下哪種生物不曾生活在禁忌森林中?",
    a: "騶吾"
  },
  {
    q: "以下哪種材料可以治療頑固性粉刺？",
    a: "泡泡莖膿汁"
  },
  {
    q: "以下哪種是黑妖精滅跡中的成分？",
    a: "綠黴怪"
  },
  {
    q: "以下誰沒有當過級長?",
    a: "哈利波特"
  },
  {
    q: "以下誰和魯霸·海格一樣是一位混血巨人？",
    a: "馬克沁夫人(美心夫人)"
  },
  {
    q: "以前英國魔法部部門間使用的通訊工具是什麼？",
    a: "貓頭鷹"
  },
  {
    q: "占卜者溫德林因為喜歡被火焰焚燒一共故意被逮捕了多少次？",
    a: "47次"
  },
  {
    q: "占卜學課本是下列中哪一本？",
    a: "《撥開未來的迷霧》"
  },
  {
    q: "古德羅‧洛哈教授失憶後被收治于聖蒙果醫院幾樓？",
    a: "五樓    #不是四樓"
  },
  {
    q: "古德羅洛哈使用了誰的魔杖施展遺忘咒失去了記憶？",
    a: "榮恩·衛斯理"
  },
  {
    q: "古德羅洛哈教授失憶後被收治于聖蒙果醫院幾樓？",
    a: "四樓"
  },
  {
    q: "古靈閣中守護金庫的龍是什麽品種？",
    a: "烏克雷恩鐵肚皮龍"
  },
  {
    q: "叫華麗與污痕(麗痕)的商店出售什麼？",
    a: "書本"
  },
  {
    q: "史拉轟教授來自哪個學院？",
    a: "史萊哲林"
  },
  {
    q: "史拉轟教授是哪一個學院的院長？",
    a: "史萊哲林"
  },
  {
    q: "史拉轟教授最喜歡的食物是什麼？",
    a: "糖霜鳳梨 / 鳳梨蜜餞 (菠蘿蜜餞)"
  },
  {
    q: "史萊哲林交誼廳位於哪裡？",
    a: "地下室(地牢)"
  },
  {
    q: "史萊哲林的小金匣由誰保管？",
    a: "怪角 "
  },
  {
    q: "史萊哲林的學院幽靈是誰?",
    a: "血腥男爵"
  },
  {
    q: "史萊哲林學生曾用哪首歌嘲諷榮恩·衛斯理？",
    a: "《衛斯理是我們的王》"
  },
  {
    q: "失敗的消影術可能會導致什麼？",
    a: "分體"
  },
  {
    q: "尼可·勒梅曾在哪裡上過學?",
    a: "波巴洞魔法學院"
  },
  {
    q: "尼法朵拉唐克斯的頭髮一般是什麼顏色？",
    a: "泡泡糖粉"
  },
  {
    q: "尼樂·勒梅曾在哪裡上學？",
    a: "波巴洞"
  },
  {
    q: "布巴吉(波八吉)教授在霍格華茲教哪一門課程？",
    a: "麻瓜研究"
  },
  {
    q: "弗立維教授教什麼課？",
    a: "魔咒學"
  },
  {
    q: "弗雷和喬治在葛來分多魁地奇球隊中擔任什麼位置?",
    a: "打擊手"
  },
  {
    q: "弗雷和喬治使用什麼東西向恩不里居(恩不裡居)示威？",
    a: "衛氏野火魔爆彈"
  },
  {
    q: "弗雷和喬治是如何獲得劫盜地圖的?",
    a: "從飛七的辦公室偷來的"
  },
  {
    q: "弗雷和喬治第一次也是最後一次看對方變老的樣子是在什麼時候？",
    a: "火盃吐出他們名字時"
  },
  {
    q: "弗雷和喬治開的商店名稱叫什麼？",
    a: "衛氏巫師法寶店"
  },
  {
    q: "用什麼方法可以獲取瞌睡豆大量汁液？",
    a: "用銀色小刀側面擠壓"
  },
  {
    q: "由哪一種杖芯製成的魔杖很難駕馭但是卻很適合用於變形？",
    a: "雷鳥的尾羽"
  },
  {
    q: "石內卜在七個波特之戰中用撕淌三步殺誤傷弗雷其實是想救誰？",
    a: "雷木思·路平"
  },
  {
    q: "石內卜告訴哈利什麼藥材可以解毒？",
    a: "(毛)糞石"
  },
  {
    q: "石內卜和誰立下了不破誓的誓言?",
    a: "水仙·馬份(納西莎·馬份)"
  },
  {
    q: "石內卜的守護神和誰的一樣？",
    a: "莉莉·伊凡"
  },
  {
    q: "石內卜的守護神咒和誰的一樣？",
    a: "莉莉·伊凡"
  },
  {
    q: "石內卜的私人儲藏室曾被闖入三次，請選出其中一次。",
    a: "小巴蒂‧克勞奇偷變身水材料"
  },
  {
    q: "石內卜的護法咒和誰一樣？",
    a: "莉莉·伊凡"
  },
  {
    q: "石內卜教授心中最重要的人是誰？",
    a: "莉莉·伊凡"
  },
  {
    q: "石內卜教授的母親？",
    a: "艾琳·史林斯"
  },
  {
    q: "石內卜教授的守護神？",
    a: "牝鹿"
  },
  {
    q: "石內卜教授的護法是什麼形態?",
    a: "母鹿"
  },
  {
    q: "石內卜教授最想要教導的課程是什麼？",
    a: "黑魔法防禦術"
  },
  {
    q: "吉德羅·洛哈使用了誰的魔杖施展遺忘咒後失去了記憶？",
    a: "榮恩·衛斯理"
  },
  {
    q: "吉德羅·洛哈曾經發明過一種洗髮水，其中含有下列哪種成分？",
    a: "兩腳蛇蛋黃"
  },
  {
    q: "吉羅德·洛哈聲稱他做的洗髮水還有什麼成分？",
    a: "兩腳蛇蛋黃"
  },
  {
    q: "在七個波特之戰中哈利·波特由於施了什麼咒語而被認出？",
    a: "繳械咒"
  },
  {
    q: "在三巫鬥法大賽中，哈利從黑湖裡救出了誰？",
    a: "榮恩和佳兒·戴樂古"
  },
  {
    q: "在三巫鬥法大賽中，是誰告訴西追如何開啟金蛋",
    a: "小巴堤·柯羅奇(小巴蒂·克勞奇)"
  },
  {
    q: "在三巫鬥法大賽中，誰沒有成功救下水下的人質？",
    a: "花(佳)兒‧戴樂古"
  },
  {
    q: "在三巫鬥法大賽時，西追·迪哥告訴了哈利·波特什麼線索？",
    a: "金蛋"
  },
  {
    q: "在三巫鬥法大賽舉辦那年的魁地奇世界盃的獲勝隊伍是？",
    a: "愛爾蘭隊"
  },
  {
    q: "在小漢果頓的墓地中，西追.迪哥裡向哈利提出的最後一個請求是什麼？",
    a: "把他的屍體帶回去給他父母"
  },
  {
    q: "在比爾和花兒的婚禮上，是誰因為露娜父親的項鍊而感到不悅？",
    a: "維克多·喀浪"
  },
  {
    q: "在古靈閣中，哪種物品被用於控制守護重要金庫的龍？",
    a: "丁當片"
  },
  {
    q: "在巫師世界，龍屬於高危險性魔法生物，魯霸·海格得到火龍蛋的方式是?",
    a: "酒館贏得的"
  },
  {
    q: "在那個糟糕的學年裡，恩不里居(恩不裡居)代理校長是如何離開霍格華茲的？",
    a: "被皮皮鬼趕出學校"
  },
  {
    q: "在使用者忘記了一些事情的時候記憶球會變成什麼顏色？",
    a: "紅色"
  },
  {
    q: "在哈利·波特三年級時，葛來分多塔的入口畫像換成了誰？",
    a: "卡多甘爵士"
  },
  {
    q: "在哈利·波特上學時期，當消失的密室被打開時，第一位被襲擊的學生是誰?",
    a: "柯林‧克利維 (科林‧克裡維)"
  },
  {
    q: "在哈利的逃亡期間，他收聽了一個廣播電臺是什麼？",
    a: "波特觀察"
  },
  {
    q: "在洛夫古德家中被實死人追殺時，妙麗對謝諾菲留斯實施了什麼咒語？",
    a: "一忘皆空"
  },
  {
    q: "在哪裡可以找到老湯姆·瑞斗的墓碑？",
    a: "小漢果頓"
  },
  {
    q: "在座有魁地奇愛好者嗎？考考你哈利·波特的第一把掃帚是什麼型號？",
    a: "光輪二千"
  },
  {
    q: "在海格的保護神奇生物課上，什麼被普遍認為是最無聊的生物？",
    a: "黏巴蟲"
  },
  {
    q: "在迷你巫師對決中，榮恩·衛斯理被哪種棋子擊中了？",
    a: "皇后"
  },
  {
    q: "在逃亡途中哈利波特從哪裡獲得葛萊分多寶劍？",
    a: "湖底"
  },
  {
    q: "在國王十字街前往霍格華茲的火車是幾點發車?",
    a: "十一點"
  },
  {
    q: "在密室，誰治好哈利被蛇妖咬傷的胳膊？",
    a: "佛客使"
  },
  {
    q: "在密室中，鳳凰的眼淚解了哪種生物的毒？",
    a: "蛇妖的毒液"
  },
  {
    q: "在密室中鳳凰佛客使為哈利波特帶來了什麼？",
    a: "分類帽"
  },
  {
    q: "在教黑魔法防禦術之前，奎若教授教什麼課？",
    a: "麻瓜研究"
  },
  {
    q: "在通往魔法石的關卡中，是誰施法設定了一關變形後的巨大棋盤？",
    a: "麥米奈娃"
  },
  {
    q: "在最後的大戦中，誰去密室拿了蛇妖的牙齒？",
    a: "妙麗和榮恩"
  },
  {
    q: "在跩哥·馬份的幫助下，食死人通過什麼進入了霍格華茲？",
    a: "消失櫥櫃(消失衣櫃)"
  },
  {
    q: "在與佛地魔的最後決戰中，誰面對佛地魔時謊稱哈利·波特死了？",
    a: "水仙·馬份(納西莎·馬份)"
  },
  {
    q: "在與佛地魔的戰鬥中，是誰的媽媽協助哈利‧波特製造了假死的假象，騙過了所有人？",
    a: "跩哥‧馬份"
  },
  {
    q: "在魁地奇比賽中，搜捕手抓住金探子給多少分？",
    a: "150"
  },
  {
    q: "在魁地奇世界中維克多·喀浪抓住金探子的戰術是什麼？",
    a: "隆斯基詐騙法"
  },
  {
    q: "在衛斯理法寶店裡買不到什麼東西？",
    a: "酷酸果"
  },
  {
    q: "在魯霸·海格之前奇獸飼育學教授是誰？",
    a: "凱特爾伯恩教授"
  },
  {
    q: "在學期結束時得分最多的霍格華茲學院贏得了什麼？",
    a: "學院杯"
  },
  {
    q: "在霍格華茲，學生能夠接受的「普等巫術等級考試」的科目最多是？",
    a: "12科"
  },
  {
    q: "在霍格華茲中，由什麼來決定新生的學院？",
    a: "分類帽"
  },
  {
    q: "在霍格華茲中，成績等級為A代表什麼？",
    a: "合格 / 及格"
  },
  {
    q: "在霍格華茲舉辦的三巫鬥法大賽第二項目中，哪個咒語被兩位選手同時使用，以完成比賽？",
    a: "氣泡頭咒(花兒&西追)"
  },
  {
    q: "在魔法火焰的灰燼可以找到什麼生物？",
    a: "火灰蛇"
  },
  {
    q: "地精的天敵是什麼生物？",
    a: "魔貂"
  },
  {
    q: "多比在收到什麼物品之後成為自由的綠仙？",
    a: "哈利波特的襪子"
  },
  {
    q: "多比營救哈利波特等人從馬份莊園傳送到哪裡？",
    a: "貝殼居"
  },
  {
    q: "多年前彼得·佩德魯被分到了哪個學院？",
    a: "葛萊分多"
  },
  {
    q: "如何正確地打開一本《怪獸的怪獸書》？",
    a: "撫摸書脊"
  },
  {
    q: "如何向鷹馬打招呼才合適?",
    a: "鞠躬並等待它主動接近"
  },
  {
    q: "如何追踪霍格華茲學院杯的分數？",
    a: "裝滿寶石的沙漏"
  },
  {
    q: "如果有人試圖闖入古靈閣713號金庫，會發生什麼？",
    a: "被吸入門中"
  },
  {
    q: "如果你想摧毀一個分靈體，下列哪個物品可能會有幫助？",
    a: "蛇妖的毒牙"
  },
  {
    q: "尖叫屋在什麼地方呢？",
    a: "活米村"
  },
  {
    q: "有人好奇路平教授的幻形怪型態是什麼嗎？",
    a: "滿月"
  },
  {
    q: "有人知道妙麗父母的職業是什麼嗎？",
    a: "牙醫"
  },
  {
    q: "有人知道是什麼讓娜吉妮變成一條蛇嗎?",
    a: "血咒"
  },
  {
    q: "有人知道是誰殺了家庭小精靈多比嗎？",
    a: "貝拉·雷斯壯"
  },
  {
    q: "有人知道是誰讓雷木思‧路平成為了狼人嗎？",
    a: "焚銳‧灰背"
  },
  {
    q: "有人為學院整支魁地奇隊伍購買了什麼型號的飛天掃帚？",
    a: "光輪2001"
  },
  {
    q: "有同學知道佛地魔的母親叫什麼名字嗎？",
    a: "魔柔(梅洛普)"
  },
  {
    q: "有個黑魔法製作的照明道具，是小偷和盜賊的最愛，其名為？",
    a: "光榮之手"
  },
  {
    q: "有幾個人曾是佛地魔認為的天選之子？",
    a: "2"
  },
  {
    q: "有誰了解多比？他屬於什麼物種？",
    a: "家庭小精靈"
  },
  {
    q: "有誰知道，石內卜教授曾是是哪個學院的院長？",
    a: "史萊哲林"
  },
  {
    q: "有誰知道，阿不思·鄧不利多的妹妹是誰？",
    a: "亞蕊安娜"
  },
  {
    q: "有誰知道，哈利·波特的中間名是什麼？",
    a: "詹姆"
  },
  {
    q: "有誰知道，哈利在哪裡購買了課本？",
    a: "華麗與污痕書店"
  },
  {
    q: "有誰知道，為什麼血腥男爵總帶著鎖鏈嗎？",
    a: "內心懺悔"
  },
  {
    q: "有誰知道，食童怪喜歡吃什麼？",
    a: "小孩"
  },
  {
    q: "有誰知道，海格養育的小龍叫什麼名字？",
    a: "諾伯 / 蘿蔔"
  },
  {
    q: "有誰知道血腥男爵是怎麼死的？",
    a: "自殺"
  },
  {
    q: "有誰知道阿不思·鄧不利多的妹妹是誰？",
    a: "阿利安娜·鄧不利多"
  },
  {
    q: "有誰知道哈利·波特的教父是誰?",
    a: "天狼星·布萊克"
  },
  {
    q: "有誰知道是誰讓萊姆斯·路平成為了狼人嗎？",
    a: "芬里爾·格雷貝"
  },
  {
    q: "有誰記得，鄧不利多教授的前一任校長姓名?",
    a: "阿曼多·狄劈"
  },
  {
    q: "有誰認識呱啦嗎?他是誰?",
    a: "海格同母異父的弟弟"
  },
  {
    q: "有誰瞭解多比？他屬於什麼物種？",
    a: "家庭小精靈"
  },
  {
    q: "有誰還記得佛地魔學生時期的名字？",
    a: "湯姆·瑞斗"
  },
  {
    q: "有暸解妙麗·格蘭傑的同學嗎？考考你她的貓叫什麼？",
    a: "歪腿"
  },
  {
    q: "死神的聖物的傳說來自於什麼故事？",
    a: "《三兄弟的故事》"
  },
  {
    q: "老湯姆·瑞斗的墓碑在哪？",
    a: "小漢格頓(小漢果頓)"
  },
  {
    q: "老魔杖的別稱中不包括什麼?",
    a: "智慧杖"
  },
  {
    q: "老魔杖的杖芯是什麼？",
    a: "夜騏的尾毛"
  },
  {
    q: "考考你們，食死人貝拉·雷斯壯的妹妹是誰？",
    a: "水仙·馬份(納西莎·馬份)"
  },
  {
    q: "血腥男爵殺害了誰？",
    a: "海蓮娜·雷文克勞"
  },
  {
    q: "血腥男爵曾經殺了誰？",
    a: "格雷女士"
  },
  {
    q: "西弗勒斯·石內卜教授的母親叫什麼？",
    a: "愛琳·普林斯"
  },
  {
    q: "西莫·斐尼甘面對幻形怪時，幻形怪變成了什麼?",
    a: "報喪女妖"
  },
  {
    q: "西莫·斐尼幹的護法是什麼？",
    a: "狐狸"
  },
  {
    q: "西莫面對幻形怪時，它變成什麼？",
    a: "報喪女妖"
  },
  {
    q: "西碧·崔老妮教授在霍格華茲教授什麼課程？",
    a: "占卜學"
  },
  {
    q: "西碧‧崔老妮教授在哈利的茶杯底見到了什麼？",
    a: "黑狗"
  },
  {
    q: "佛地魔分靈體之一的史萊哲林小金匣由誰保管？",
    a: "克利切"
  },
  {
    q: "佛地魔用什麼藥水保護藏在岩洞中的分體？",
    a: "絕望藥水"
  },
  {
    q: "佛地魔在哪裡得到接骨木魔杖的？",
    a: "霍格華茲"
  },
  {
    q: "佛地魔的哪個分靈體被藏在古靈閣萊斯壯倉庫？",
    a: "海加·赫夫帕夫的金盃"
  },
  {
    q: "佛地魔的哪個分靈體被藏在古靈閣雷斯壯倉庫？",
    a: "海加‧赫夫帕夫的金杯"
  },
  {
    q: "佛地魔的寵物娜吉妮體長多少？",
    a: "12英尺"
  },
  {
    q: "佛地魔曾喝了誰的血來維持生命？",
    a: "獨角獸的血"
  },
  {
    q: "佛地魔學生時代的黑魔法防禦術老師叫什麼？",
    a: "美思教授(梅樂思教授)"
  },
  {
    q: "佛客使屬於哪種生物？",
    a: "鳳凰"
  },
  {
    q: "你能在哪條街上找到波金與伯克氏商店(博金博克商店)？",
    a: "夜行巷"
  },
  {
    q: "你會在哪條街上找到黑魔法商店博金博克？",
    a: "夜行巷"
  },
  {
    q: "你會在哪裡找到老湯姆·瑞斗的墓碑？",
    a: "小漢果頓"
  },
  {
    q: "克魯克山是一隻什麼顏色的貓？",
    a: "薑黃色"
  },
  {
    q: "初入霍格華茲的第一學年，哈利、榮恩和妙麗在盥洗室打敗了什麼生物?",
    a: "山怪"
  },
  {
    q: "劫盜者中誰的家族都來自史萊哲林？",
    a: "天狼星·布萊克"
  },
  {
    q: "妙麗·格蘭傑三人第一次配置複方藥劑花了多長時間?",
    a: "一個月"
  },
  {
    q: "妙麗·格蘭傑用了誰的簽名才能借到《超強魔藥》(《強力藥劑》)？",
    a: "吉德羅·洛哈"
  },
  {
    q: "妙麗·格蘭傑的護法是什麼形態？",
    a: "水獺"
  },
  {
    q: "妙麗·格蘭傑的OWLS成績中哪一科只取得了E（良好）？",
    a: "黑魔法防禦術"
  },
  {
    q: "妙麗·格蘭傑最不擅長的咒語是什麼？",
    a: "護法咒"
  },
  {
    q: "妙麗·格蘭傑最不擅長的課程是什麼?",
    a: "占卜學"
  },
  {
    q: "妙麗·格蘭傑曾被誰用酷刑咒折磨過？",
    a: "貝拉·雷斯壯"
  },
  {
    q: "妙麗·格蘭傑曾經收過麥教授的禮物，禮物是什麼呢?",
    a: "時光器"
  },
  {
    q: "妙麗·格蘭傑曾經喝下變身水變成以下哪種樣子？",
    a: "貓女"
  },
  {
    q: "妙麗·格蘭傑開學前在哪本書上看到了霍格華茲的交誼廳？",
    a: "《霍格華茲：一段歷史》"
  },
  {
    q: "妙麗·格蘭傑對自己的父母施展魔法讓他們搬家去了哪裡?",
    a: "澳大利亞"
  },
  {
    q: "妙麗·格蘭傑與哈利·波特見面時，使用的第一個咒語是？",
    a: "恢復如初(修復如初復復修／修復咒)"
  },
  {
    q: "妙麗第一次喝變身水時原本想偽裝成誰？",
    a: "米莉森·布洛德"
  },
  {
    q: "妙麗創立的家庭小精靈權利促進協會的縮寫是？",
    a: "S.P.E.W."
  },
  {
    q: "妙麗發現蛇妖通過什麼在在城堡中移動？",
    a: "管道"
  },
  {
    q: "妙麗發現蛇妖通過什麼在城堡中移動？",
    a: "渠道"
  },
  {
    q: "孚立維教授用了什麼方式保護魔法石？",
    a: "施了魔法的鑰匙"
  },
  {
    q: "孚立維教授是哪門課的老師？",
    a: "符咒學"
  },
  {
    q: "孚立維教授是哪個學院的院長？",
    a: "雷文克勞"
  },
  {
    q: "巫師卡中“卑鄙的海爾波(惡人赫珀)”培育出了什麼神奇生物(奇獸)？",
    a: "蛇妖"
  },
  {
    q: "快樂咒是哈利在幾年級學到的?",
    a: "三年級"
  },
  {
    q: "貝拉·雷斯壯折磨瘋了誰的父母？",
    a: "奈威·隆巴頓"
  },
  {
    q: "貝拉·雷斯壯被誰殺死？",
    a: "茉莉·衛斯理"
  },
  {
    q: "辛尼區教授在霍格華茲教哪一門課程？",
    a: "天文學"
  },
  {
    q: "那一種翠綠色的藥水會讓人産生恐懼和幻覺？",
    a: "絕望藥水"
  },
  {
    q: "那些通過抓捕麻瓜出生者或所謂「血統叛徒」來換取金錢的人被稱為什麼？",
    a: "死拿錢 / 搜捕隊員"
  },
  {
    q: "亞瑟·衛斯理在遭到娜吉妮攻擊後被送去了哪裡？",
    a: "聖蒙果魔法疾病與傷害醫院"
  },
  {
    q: "佩妮‧德思禮曾給莉莉‧波特寄去哪件禮物?",
    a: "花瓶"
  },
  {
    q: "到霍格華茲所要乘的特快列車編號是多少？",
    a: "5972"
  },
  {
    q: "受到催狂魔的襲擊後，食用哪種食物可以有效緩解不適？",
    a: "巧克力"
  },
  {
    q: "呱啦第一次見到妙麗時送她什麼東西？",
    a: "自行車手把"
  },
  {
    q: "呼嚕粉是由誰發明的？",
    a: "伊格內希婭·懷爾德史密斯"
  },
  {
    q: "呼嚕網將什麽連接在一起？",
    a: "壁爐"
  },
  {
    q: "和天狼星·布萊克一起逃跑的鷹馬叫什麼名字？",
    a: "巴嘴"
  },
  {
    q: "奇獸動物園位在哪裡？",
    a: "斜角巷"
  },
  {
    q: "奇獸飼育學課上海格所使用的教科書是什麼？",
    a: "《怪獸的怪獸書》"
  },
  {
    q: "奈威·隆巴頓父母的職業是什麼？",
    a: "正氣師"
  },
  {
    q: "奈威·隆巴頓教授剛到霍格華茲讀書時，他想被分到哪個學院？",
    a: "赫夫帕夫"
  },
  {
    q: "奈威·隆巴頓教授最擅長的科目是什麼？",
    a: "草藥學"
  },
  {
    q: "岡特(剛特)的戒指是在哪被摧毀的?",
    a: "校長室"
  },
  {
    q: "彼得·佩迪魯變成過什麼動物？",
    a: "老鼠"
  },
  {
    q: "彼得·佩德魯的別稱？",
    a: "蟲尾"
  },
  {
    q: "彼得‧佩迪魯在佛地魔復活後還剩幾根手指？",
    a: "5根"
  },
  {
    q: "彼得‧佩迪魯缺少的是哪根指頭?",
    a: "右手食指"
  },
  {
    q: "怪獸與牠們的產地中，紐特‧斯卡曼德為了讓紐約的市民失憶，使用了哪種動物的經稀釋的毒液？",
    a: "惡閃鴉"
  },
  {
    q: "怪獸與牠們的產地的作者是誰?",
    a: "紐特·斯卡曼德"
  },
  {
    q: "波巴洞的校長歐琳·美心夫人說她的馬只喝什麼？",
    a: "純麥威士忌"
  },
  {
    q: "波巴洞魔法學校位於哪個國家？",
    a: "法國"
  },
  {
    q: "波巴洞魔法學校參加三巫鬥法大賽時城做哪種交通工具？",
    a: "波巴洞馬車"
  },
  {
    q: "波巴洞魔法學院坐落在哪裡？",
    a: "法國南部比利牛斯山"
  },
  {
    q: "波巴洞魔法學院的馬車由什麼生物牽引？",
    a: "天馬"
  },
  {
    q: "直到20世紀30年代仍舊是真正純血統的英國巫師家族有幾個？",
    a: "28"
  },
  {
    q: "知名的魁地奇世界盃選手維克多·喀浪是哪個國家代表隊的？",
    a: "保加利亞隊"
  },
  {
    q: "花兒·德拉庫爾(花兒·戴樂古)在耶誕舞會上的舞伴是誰？",
    a: "羅傑·達維"
  },
  {
    q: "花兒·德拉庫爾(花兒·戴樂古)的妹妹是誰？",
    a: "加布麗"
  },
  {
    q: "芽菜教授用成熟的什麼救了密室中被蛇妖石化的學生們和拿樂絲太太？",
    a: "魔蘋果"
  },
  {
    q: "芽菜教授在霍格華茲教授哪門課程？",
    a: "藥草學"
  },
  {
    q: "芽菜教授是哪個學院的院長?",
    a: "赫夫帕夫"
  },
  {
    q: "金妮·衛斯理名字中的“金妮”是什麼的簡稱？",
    a: "吉尼芙拉（金妮芙拉）"
  },
  {
    q: "金妮·衛斯理的蒲絨絨(迷你毛毛球)叫什麼名字？",
    a: "阿洛(阿囡)"
  },
  {
    q: "金探子翅膀是什麼顏色？",
    a: "銀色"
  },
  {
    q: "金探子被發明之前，魁地奇比賽中使用是哪一種生物？",
    a: "金探鳥"
  },
  {
    q: "阿不拉薩·馬份的死因是什麼？",
    a: "龍痘瘡"
  },
  {
    q: "阿不思·鄧不利多在什麼地方與蓋勒·葛林戴華德相識？",
    a: "高錐客洞"
  },
  {
    q: "阿不思·鄧不利多沒能直接通過魔法部長交給哈利·波特等三人的遺物是什麼?",
    a: "葛來分多寶劍"
  },
  {
    q: "阿不思·鄧不利多的出生地是?",
    a: "軟泥山丘"
  },
  {
    q: "阿不思·鄧不利多的守護神是什麼？",
    a: "山羊"
  },
  {
    q: "阿不思·鄧不利多派誰在麻瓜世界保護哈利?",
    a: "費格太太"
  },
  {
    q: "阿不思·鄧不利多將什麼遺贈給妙麗？",
    a: "《吟遊詩人皮陀故事集》"
  },
  {
    q: "阿不思·鄧不利多將什麼遺贈給榮恩？",
    a: "熄燈器"
  },
  {
    q: "阿不思·鄧不利多曾擁有幾件死神聖物？",
    a: "三件"
  },
  {
    q: "阿不思·鄧不利多對哈利·波特在說他魔鏡裡看到了什麼?",
    a: "羊毛襪"
  },
  {
    q: "阿不思·鄧不利多讓誰去馬份宅去救哈利三人組？",
    a: "多比"
  },
  {
    q: "阿尼馬格斯形態下的小天狼星·布萊克被稱為大腳板或什麼？",
    a: "獸足"
  },
  {
    q: "阿波佛‧鄧不利多的護法是什麼？",
    a: "山羊"
  },
  {
    q: "阿茲卡班的守衛是什麼？",
    a: "催狂魔"
  },
  {
    q: "附子和牛扁的區別是什麼？",
    a: "沒有區別"
  },
  {
    q: "前黑魔法防禦課老師吉德羅·洛哈最擅長的咒語是什麼？",
    a: "空空，遺忘"
  },
  {
    q: "哈利，榮恩和妙麗最喜歡到破釜酒吧喝的飲品是？",
    a: "黃(奶)油啤酒"
  },
  {
    q: "哈利、妙麗、衛斯理一家在哪裡使用了港口鑰去魁地奇世界盃場地？",
    a: "鼬頭丘"
  },
  {
    q: "哈利、榮恩和妙麗最初懷疑誰想要偷走魔法石？",
    a: "賽佛勒斯·石內卜"
  },
  {
    q: "哈利．波特在禁忌森林中被催狂魔圍攻時，是誰救了他？",
    a: "哈利．波特"
  },
  {
    q: "哈利·波特三年級時，為什麼沒能和其他同學一起去活米村？",
    a: "他的姨丈沒有簽同意書"
  },
  {
    q: "哈利·波特三年級時，為什麼沒能和其他同學一起去霍格莫德？",
    a: "他的姨父沒有簽同意書"
  },
  {
    q: "哈利·波特四年級時進入校長室的密語是?",
    a: "蟑螂堆/串"
  },
  {
    q: "哈利·波特生日的時候，衛斯理夫人送他什麼禮物？",
    a: "手錶"
  },
  {
    q: "哈利·波特在三巫鬥法大賽中需要從哪種龍那裡取走金蛋？",
    a: "匈牙利角尾龍"
  },
  {
    q: "哈利·波特在三巫鬥法大賽帶回了誰的屍體？",
    a: "西追·迪戈里"
  },
  {
    q: "哈利·波特在火盃第二項比賽中使用了哪種植物？",
    a: "魚鰓草"
  },
  {
    q: "哈利·波特在目睹誰的死亡後才看到騎士墮鬼馬？",
    a: "西追·迪戈里"
  },
  {
    q: "哈利·波特在哪裡第一次收到了魯霸·海格的生日蛋糕？",
    a: "礁石上的小屋"
  },
  {
    q: "哈利·波特在校時，誰的成績總是班級第一？",
    a: "妙麗·格蘭傑"
  },
  {
    q: "哈利·波特在逃亡過程中在哪裡拿到了葛來分多寶劍？",
    a: "湖底"
  },
  {
    q: "哈利·波特在動物園使用過什麼天賦？",
    a: "爬說語"
  },
  {
    q: "哈利·波特收到的第一把飛天掃帚是誰贈送的？",
    a: "麥教授"
  },
  {
    q: "哈利·波特把什麼遺落在禁忌森林？",
    a: "重生石"
  },
  {
    q: "哈利·波特把哪件聖器遺棄在了禁忌森林？",
    a: "重生石"
  },
  {
    q: "哈利·波特沒有擔任過哪個職務？",
    a: "S.P.E.W財務總管"
  },
  {
    q: "哈利·波特使用什麼破壞了湯姆·瑞斗的日記？",
    a: "蛇妖的毒牙"
  },
  {
    q: "哈利·波特和天狼星·布萊克被攝魂暈倒，是誰施了護法咒咒驅趕了所有催狂魔？",
    a: "哈利·波特"
  },
  {
    q: "哈利·波特和他的麻瓜親戚德思禮一家住在哪兒？",
    a: "水蠟樹街"
  },
  {
    q: "哈利·波特和阿不思·鄧不利多最後一次見面是在哪裡？",
    a: "王十字車站"
  },
  {
    q: "哈利·波特和榮恩·衛斯理用什麼撞到了渾拚柳?",
    a: "飛行汽車"
  },
  {
    q: "哈利·波特的小女兒叫什麼名字？",
    a: "莉莉露娜·波特"
  },
  {
    q: "哈利·波特的出生地是哪裡？",
    a: "高錐客洞"
  },
  {
    q: "哈利·波特的初戀是誰？",
    a: "張秋"
  },
  {
    q: "哈利·波特的室友丁‧湯馬斯喜歡哪項運動?",
    a: "足球"
  },
  {
    q: "哈利·波特的祖父從事什麼工作發家？",
    a: "護髮藥水"
  },
  {
    q: "哈利·波特的摯友榮恩·衛斯理有多少兄弟姐妹？",
    a: "6個"
  },
  {
    q: "哈利·波特的貓頭鷹叫什麼名字？",
    a: "嘿美"
  },
  {
    q: "哈利·波特的護法是哪種動物？",
    a: "雄鹿"
  },
  {
    q: "哈利·波特的魔杖是什麼材質？",
    a: "冬青木"
  },
  {
    q: "哈利·波特是什麼咒語的唯一倖存者？",
    a: "阿哇呾喀呾啦"
  },
  {
    q: "哈利·波特是皮福雷三兄弟中誰的後代？",
    a: "伊諾特"
  },
  {
    q: "哈利·波特是通過打敗誰成為接骨木魔杖的主人？",
    a: "德柯拉·馬份"
  },
  {
    q: "哈利·波特畢業後去做了什麼工作？",
    a: "正氣師"
  },
  {
    q: "哈利·波特第一次抓住金探子是用哪裡抓住的？",
    a: "用嘴抓住"
  },
  {
    q: "哈利·波特第一次見到奎若教授是在哪裡？",
    a: "破釜酒吧"
  },
  {
    q: "哈利·波特第一次使用飛路粉（呼嚕粉）時誤入了哪裡?",
    a: "博金·博克古董商店"
  },
  {
    q: "哈利·波特第一次喝福來福喜喝了多少？",
    a: "一小口"
  },
  {
    q: "哈利·波特被食死人抓到馬份莊園時，用的什麼名字？",
    a: "弗農·達利"
  },
  {
    q: "哈利·波特最擅長什麼咒語?",
    a: "去去武器走（繳械咒）"
  },
  {
    q: "哈利·波特曾在什麼節日時回到了父母犧牲的家？",
    a: "耶誕節"
  },
  {
    q: "哈利·波特曾在葛來分多魁地奇球隊打什麼位置？",
    a: "搜捕手"
  },
  {
    q: "哈利·波特曾和他麻瓜親戚德思禮一家住在哪兒？",
    a: "水蠟樹街"
  },
  {
    q: "哈利·波特曾經被叫作過什麼？",
    a: "爛疤頭"
  },
  {
    q: "哈利·波特曾經試圖取得水下的葛萊分多寶劍差點淹死，是被誰所救?",
    a: "榮恩·衛斯理"
  },
  {
    q: "哈利·波特進入霍格華茲第一天的葛來分多交誼廳的密語是什麼?",
    a: "龍渣"
  },
  {
    q: "哈利·波特學生時，羅咪·凡曾十分迫切的想與他約會原因是？",
    a: "他是被選中的孩子"
  },
  {
    q: "哈利·波特學生時期的藥草學老師是誰？",
    a: "芽菜教授"
  },
  {
    q: "哈利·波特繼承的死神聖物是什麼？",
    a: "隱身衣(隱形斗篷)"
  },
  {
    q: "哈利‧波特一年級拿到魔法石時穿的是什麼顏色的毛衣?",
    a: "紅色"
  },
  {
    q: "哈利‧波特之外還有誰能拔出葛來分多寶劍？",
    a: "奈威‧隆巴頓"
  },
  {
    q: "哈利‧波特的姨父姨媽告訴哈利父母的死亡原因是什麼呢？",
    a: "車禍"
  },
  {
    q: "哈利‧波特的眼鏡被誰修復過一次？",
    a: "妙麗·格蘭傑 / 妙麗"
  },
  {
    q: "哈利‧波特第一次來到古靈閣時，帶領他們去金庫的妖精是誰？",
    a: "拉環"
  },
  {
    q: "哈利‧波特被佛地魔魔咒殺死以後，是誰幫助了哈利隱瞞未死亡的資訊？",
    a: "水仙·馬份(納西莎·馬份)"
  },
  {
    q: "哈利‧波特被催狂魔攻擊看見的景象？",
    a: "母親被攻擊的畫面"
  },
  {
    q: "哈利一年級在與奎若對抗後住進校醫院，海格來探望時送了什麼禮物？",
    a: "哈利父母的照片"
  },
  {
    q: "哈利一年級時，誰在禁忌森林中保護了他？",
    a: "翡冷翠"
  },
  {
    q: "哈利一年級時，霍格華茲城堡中的哪個地方是禁止學生入內的？",
    a: "四樓走廊"
  },
  {
    q: "哈利二年級開學時，以什麼交通方式到達了霍格華茲？",
    a: "一輛會飛的車"
  },
  {
    q: "哈利三人組在誰的幫助下溜進古靈閣？",
    a: "拉環"
  },
  {
    q: "哈利三年級時，黑魔法防禦術課上遭遇的幻形怪是什麼形態？",
    a: "催狂魔"
  },
  {
    q: "哈利三年級開學時，霍格華茲特快車上什麼導致了哈利暈倒？",
    a: "催狂魔"
  },
  {
    q: "哈利上一年級時，誰跑到禮堂告訴大家一隻山怪被放出來了?",
    a: "奎若教授"
  },
  {
    q: "哈利四年級時聖誕舞會上的舞伴？",
    a: "芭蒂‧巴堤(帕瓦蒂‧佩蒂爾)"
  },
  {
    q: "哈利用爬說嘴和什麼動物說過話？",
    a: "蛇"
  },
  {
    q: "哈利因在麻瓜面前召喚護法而被傳喚後，誰主持了他的庭審？",
    a: "阿米莉亞·波恩女士(愛蜜莉‧波恩)"
  },
  {
    q: "哈利因為在麻瓜面前召喚護法被審訊時，誰當了他的證人？",
    a: "阿拉貝拉·費格"
  },
  {
    q: "哈利在火車上拆巧克力蛙卡片時，獲得的第一個人物是？",
    a: "阿不思·鄧不利多"
  },
  {
    q: "哈利在目睹誰的死亡後能看到騎士墜鬼馬？",
    a: "西追·迪哥裡"
  },
  {
    q: "哈利在活點地圖上看到了哪個他以為已經死去的人?",
    a: "彼得·佩迪魯"
  },
  {
    q: "哈利在哪裡找到了魔法石？",
    a: "他的口袋裡"
  },
  {
    q: "哈利在級長浴室遇到了誰？",
    a: "愛哭鬼麥朵"
  },
  {
    q: "哈利在華麗與污痕書店看到過誰的簽售會？",
    a: "吉德羅·洛哈"
  },
  {
    q: "哈利在截盜地圖上看到了哪個他以為已經死去的人？",
    a: "彼得·佩迪魯"
  },
  {
    q: "哈利在學習護法咒時，使用過下列哪一段回憶?",
    a: "他第一次騎上飛天掃帚"
  },
  {
    q: "哈利在霍格華茲誰是班上的第一名？",
    a: "妙麗·格蘭傑"
  },
  {
    q: "哈利在儲思盆中看到石內卜的記憶，記憶裡他們正在進行什麼考試？",
    a: "黑魔法防禦術"
  },
  {
    q: "哈利在魔藥學上因為製作哪種魔藥獲得了福來福喜?",
    a: "一飲活死水"
  },
  {
    q: "哈利吹飛姑媽離開家後在灌木叢裡看到了什麼?",
    a: "小天狼星"
  },
  {
    q: "哈利使用過幾次港口鑰",
    a: "7次"
  },
  {
    q: "哈利和榮恩從山怪手裡救出妙麗的那一天是詹姆和莉莉逝世的幾週年",
    a: "十周年"
  },
  {
    q: "哈利和榮恩駕駛的福特飛天汽車最後撞到了什麼？",
    a: "渾拚柳"
  },
  {
    q: "哈利和鄧不利多在岩洞中遇到了什麽可怕的東西？",
    a: "行屍"
  },
  {
    q: "哈利波特的出生地是？",
    a: "戈德里克山谷（高錐客洞）"
  },
  {
    q: "哈利的初戀是誰？",
    a: "張秋"
  },
  {
    q: "哈利的第一位黑魔法防禦術教授是誰？",
    a: "奎裡納斯奎若"
  },
  {
    q: "哈利的第一根魔杖多長？",
    a: "11英吋"
  },
  {
    q: "哈利的第一根魔杖杖芯是什麼？",
    a: "鳳凰羽毛"
  },
  {
    q: "哈利是什麼咒語的倖存者",
    a: "啊哇呾喀呾啦"
  },
  {
    q: "哈利為什麼沒有收到魔法部的第一封警告信？",
    a: "被多比攔截了"
  },
  {
    q: "哈利堅稱佛地魔捲土重來，恩不里居(恩不裡居)懲罰他反復抄寫什麼？",
    a: "我不可以說謊"
  },
  {
    q: "哈利第一次吃巧克力蛙時榮恩說他大約有多少張巧克力蛙卡片?",
    a: "500張"
  },
  {
    q: "哈利第一次使用「倒倒吊」時，被倒掛的人是誰？",
    a: "榮恩·衛斯理"
  },
  {
    q: "哈利第一次受邀去參加史拉轟的派對時是和誰站在一起？",
    a: "露娜.羅古德"
  },
  {
    q: "哈利第一次參加魁地奇比賽前，妙麗借給了他一本什麼書?",
    a: "穿越歷史的魁地奇 / 魁地奇古史"
  },
  {
    q: "哈利暑假在家寫的魔法史論文題目為？",
    a: "《十四世紀燒死女巫的做法完全是無稽之談》"
  },
  {
    q: "哈利曾把什麼道具放在麻瓜出身登記委員會主任辦公室門口引起了騷亂?",
    a: "誘餌炸彈"
  },
  {
    q: "哈利搭乘騎士公車去了哪裡?",
    a: "破釜酒吧"
  },
  {
    q: "哈利懷疑小天狼星有危險時，他以什麼交通方式到達了魔法部？",
    a: "騎士墜鬼馬"
  },
  {
    q: "奎若教授用了哪種樂器使毛毛放鬆警惕？",
    a: "被施了魔法的豎琴"
  },
  {
    q: "奎若教授第一次遇到佛地魔是在哪兒？",
    a: "阿爾巴尼亞的黑森林"
  },
  {
    q: "威農·德斯禮在格朗寧公司是什麼職位?",
    a: "主管"
  },
  {
    q: "幽靈血腥男爵最喜歡的女孩是誰？",
    a: "海蓮娜·雷文克勞"
  },
  {
    q: "是誰在第二次巫師大戰期間利用雙面鏡幫助了哈利‧波特？",
    a: "阿波佛‧鄧不利多"
  },
  {
    q: "是誰在湖邊擊退催狂魔解救哈利·波特?",
    a: "哈利·波特"
  },
  {
    q: "是誰告訴了哈利波特巧克力可以緩解催狂魔帶來的負面情緒?",
    a: "雷木思·路平"
  },
  {
    q: "是誰使用了時光器來應對多門選修課？",
    a: "妙麗·格蘭傑"
  },
  {
    q: "是誰將跩哥‧馬份變成白鼬的？",
    a: "小巴蒂·克勞奇 (小巴堤·柯羅奇)"
  },
  {
    q: "是誰將寫有哈利波特名字的紙條投入了火盃中？",
    a: "小巴蒂·克勞奇 (小巴堤·柯羅奇)"
  },
  {
    q: "是誰殺死了文妲·布朗？",
    a: "焚銳·灰背 / 焚銳·格雷伯克"
  },
  {
    q: "是誰創建了S.P.E.W.家庭小精靈權益促進會？",
    a: "妙麗·格蘭傑"
  },
  {
    q: "是誰給衛斯理兄弟第一筆開店的資金？",
    a: "哈利‧波特"
  },
  {
    q: "是誰開啟了消失的密室？",
    a: "金妮·衛斯理"
  },
  {
    q: "是誰讓多比去馬份莊園救哈利三人組？",
    a: "阿波佛·鄧不利多"
  },
  {
    q: "是誰讓哈利·波特知道巧克力可以緩解催狂魔帶來的負面情緒？",
    a: "雷木思·路平"
  },
  {
    q: "柏蒂全口味豆有幾種口味？",
    a: "20"
  },
  {
    q: "查理·衛斯理在哪兒研究龍？",
    a: "羅馬尼亞"
  },
  {
    q: "歪腿是一隻什麼顏色的貓？",
    a: "薑黃色"
  },
  {
    q: "洛夫古德（羅古德）家的造型像迷你巫師哪個棋子？",
    a: "車(大車)"
  },
  {
    q: "洛哈教授曾在黑魔法防禦術上，把什麼奇獸放了出來？",
    a: "康瓦爾郡綠仙"
  },
  {
    q: "活米村妖精叛亂的時間是？",
    a: "1612年"
  },
  {
    q: "活米村備受歡迎的甜點商店叫什麼名字？",
    a: "蜂蜜公爵糖果店"
  },
  {
    q: "派西·衛斯理曾在陋居讀過什麼書？",
    a: "《級長該如何獲得權力》 "
  },
  {
    q: "派西‧衛斯理曾在舊雜貨舖裡閱讀什麼書？",
    a: "功成名就的級長們"
  },
  {
    q: "為了和哈利一起去尋找分靈體，榮恩改造了什麼生物來扮演像得了散花痘的自己？",
    a: "惡鬼"
  },
  {
    q: "為了轉移哈利·波特，鳳凰社的成員們使用了哪種魔藥？",
    a: "變身水"
  },
  {
    q: "為什麼一年級後的那個暑假哈利沒有收到一封信?",
    a: "多比攔截了信件"
  },
  {
    q: "為什麼霍格華茲有些學生沒有因蛇妖而亡，只是被石化了?",
    a: "間接看到蛇妖"
  },
  {
    q: "為何學生懷疑哈利是史萊哲林的後代？",
    a: "他會說爬說語"
  },
  {
    q: "為消遣和盈利而飼養火龍中建議用什麼餵養新出生的龍？",
    a: "白蘭地混雞血"
  },
  {
    q: "甚麼草藥有強大的治癒效果？",
    a: "白鮮"
  },
  {
    q: "看守魔法石的三頭犬叫作什麼？",
    a: "路威(毛毛)"
  },
  {
    q: "研究神奇生物(奇獸)的巫師叫什麼？",
    a: "神奇動物學家(奇獸飼育學家)"
  },
  {
    q: "研究魔法生物的巫師叫什麼？",
    a: "保護奇獸家( 奇獸飼育家 )"
  },
  {
    q: "紅軟帽通常在哪裡被發現？",
    a: "有流血的地方"
  },
  {
    q: "美國的伊法魔尼魔法學校由誰的後人創建？",
    a: "史萊哲林"
  },
  {
    q: "美國的巫師稱非魔法群體是什麼？",
    a: "莫魔"
  },
  {
    q: "胖夫人是哪個學院門口的畫像？",
    a: "葛萊分多 "
  },
  {
    q: "胡奇夫人曾用過哪一種飛天掃帚？",
    a: "銀箭號"
  },
  {
    q: "英國魔法部使用什麼方式取代了貓頭鷹傳遞資訊？",
    a: "紙飛機"
  },
  {
    q: "英國魔法部的來賓入口是什麼建築物？",
    a: "電話亭"
  },
  {
    q: "英國魔法部高級法院的組織名稱叫什麼？",
    a: "巫審加碼"
  },
  {
    q: "英國魔法部魔法兄弟噴泉中不包含下列哪種生物？",
    a: "黑妖精／火龍"
  },
  {
    q: "食死人的手臂上紋著什麼圖案？",
    a: "黑魔標記"
  },
  {
    q: "倫敦最出名的魔法報紙是什麼?",
    a: "《預言家日報》"
  },
  {
    q: "哪一位妖精協助哈利·波特從古靈閣獲得了分靈體?",
    a: "拉環"
  },
  {
    q: "哪一位教授之前曾是一位決鬥大師？",
    a: "孚立維教授"
  },
  {
    q: "哪一門學科研究的是數位的魔力？",
    a: "算數占卜"
  },
  {
    q: "哪一個魔法道具不是衛斯理攣生兄弟的發明？",
    a: "變熱假加隆"
  },
  {
    q: "哪一項是大眾認可的赫夫帕夫學院的特質？",
    a: "忠誠"
  },
  {
    q: "哪一種刊物被指刊登陰謀論和虛構生物?",
    a: "《謬論家》《唱唱反調》"
  },
  {
    q: "哪一種奇獸有獅子的頭、山羊的身體和龍尾巴？",
    a: "獅面龍尾羊"
  },
  {
    q: "哪一種奇獸的鳴叫可以讓人發瘋？",
    a: "彩鳴鳥"
  },
  {
    q: "哪一種奇獸被麻瓜們稱為渡渡鳥？",
    a: "謎蹤鳥"
  },
  {
    q: "哪一種奇獸被稱為愛爾蘭鳳凰?",
    a: "報喪鴉(卜鳥)"
  },
  {
    q: "哪一種神奇生物有人的頭、獅子的身體和蠍子的尾巴？",
    a: "人頭獅身蠍尾獸"
  },
  {
    q: "哪一種翠綠色的藥水會讓人產生恐懼和幻覺？",
    a: "絕望藥水"
  },
  {
    q: "哪一種龍被認為是最美的龍？",
    a: "紐澳彩眼龍(澳洲蛋白眼)"
  },
  {
    q: "哪一種魔藥中含有毛蟲切片?",
    a: "縮骨藥水(縮骨水)"
  },
  {
    q: "哪本書上有變身水的配製方法？",
    a: "《超強魔藥》《強力藥劑》"
  },
  {
    q: "哪本書不是麗塔·史譏的著作？",
    a: "《糊弄麻瓜的簡單法術》"
  },
  {
    q: "哪些人目睹了桃樂絲·恩不里居(桃樂絲·恩不裡居)將海格開除？",
    a: "正在考天文學O.W.L.S的學生們"
  },
  {
    q: "哪個不是佛地魔的分靈體?",
    a: "接骨木魔杖"
  },
  {
    q: "哪個不是活點地圖（劫盜地圖）的創造者？",
    a: "瘋眼穆迪"
  },
  {
    q: "哪個來自禁忌森林的人馬成了霍格華茲的教授？",
    a: "翡冷翠"
  },
  {
    q: "哪個咒語不是混血王子發明的?",
    a: "默默靜"
  },
  {
    q: "哪個故事沒有被收錄在《吟遊詩人皮陀故事集》中？",
    a: "巫師的飛天掃把"
  },
  {
    q: "哪個家族喜歡在家庭小精靈老的時候，把他的頭砍掉掛到牆壁上？",
    a: "布萊克家族"
  },
  {
    q: "哪個電台播放反對佛地魔的廣播？",
    a: "波特觀察"
  },
  {
    q: "哪副畫像守護葛萊芬多交誼廳入口？",
    a: "胖夫人"
  },
  {
    q: "哪裡可以買到雙頭無尾水螈？",
    a: "奇獸動物園"
  },
  {
    q: "哪種藥材會讓碰到的人外觀上長出厚厚的硬皮？",
    a: "肉瘤粉(疣疥粉)"
  },
  {
    q: "哪種魔法生物像家貓？",
    a: "獅尾貓"
  },
  {
    q: "哭泣的麥朵是哪個學院的？",
    a: "雷文克勞"
  },
  {
    q: "家庭小精靈多比最初的主人是誰？",
    a: "魯休思·馬份"
  },
  {
    q: "差點沒頭的尼克喜歡別人叫他什麼？",
    a: "尼古拉斯爵士"
  },
  {
    q: "恩不里居(恩不裡居)的黑魔法防禦術課使用的課本是什麼？",
    a: "《魔法防禦理論》"
  },
  {
    q: "時光器每轉一次能回到多久以前？",
    a: "一個小時"
  },
  {
    q: "校醫院的龐芮夫人曾使用什麼藥水治療被石化的學生？",
    a: "魔蘋果恢復劑"
  },
  {
    q: "根據推測，佛地魔的母親是使用哪種方式讓他的父親愛上她的？",
    a: "使用意亂情迷水(使用迷情劑)"
  },
  {
    q: "根據霍格華茲校規規定，學生幾年級之後才可以前往活米村？",
    a: "三年級"
  },
  {
    q: "格雷女士(灰女士)生前的名字為？",
    a: "海蓮娜·雷文克勞 "
  },
  {
    q: "格雷女士一般只跟哪個學院的人說話?",
    a: "雷文克勞"
  },
  {
    q: "桃樂絲·恩不里居(桃樂絲·恩不裡居)的護法是什麼?",
    a: "貓"
  },
  {
    q: "桃樂絲·恩不里居(桃樂絲·恩不裡居)建立了什麼學生組織來維持校園秩序？",
    a: "督察小組"
  },
  {
    q: "海格在霍格華茲上學期養過什麼當寵物?",
    a: "八眼巨蛛"
  },
  {
    q: "海格如何描述牙牙？",
    a: "膽小"
  },
  {
    q: "海格使用什麼交通工具把小哈利·波特送到水蠟樹街4號？",
    a: "會飛的摩托車"
  },
  {
    q: "海格為什麼被送進阿茲卡班？",
    a: "密室再度打開"
  },
  {
    q: "海格教授曾起過他有個同父異母的弟弟，你們知道他叫什麼嗎？",
    a: "呱啦"
  },
  {
    q: "海格教授曾提起過，他在夜行巷找什麼驅蟲劑時，遇見了迷路的哈利？",
    a: "食肉蛞蝓"
  },
  {
    q: "海格教授曾經養大的八眼巨蛛叫什麼名子?",
    a: "阿辣哥"
  },
  {
    q: "海格曾說，除了霍格華茲之外，世界上最安全的地方是哪裡？",
    a: "古靈閣"
  },
  {
    q: "海格給鷹馬巴嘴取的新名字是什麼？",
    a: "枯翅"
  },
  {
    q: "海格孵出的小龍叫什麼名字？",
    a: "諾伯 / 蘿蔔"
  },
  {
    q: "海蓮娜·雷文克勞把她母親的冠冕藏在哪裡？",
    a: "在一顆空心的樹中"
  },
  {
    q: "烏頭又被稱為舟形烏頭和什麼？",
    a: "牛扁"
  },
  {
    q: "狼人焚銳·格雷貝克是什麼邪惡群體的頭目？",
    a: "搜捕隊頭目(灰背)"
  },
  {
    q: "眨眨原先是誰的家庭小精靈？",
    a: "巴堤‧柯羅奇"
  },
  {
    q: "破壞赫夫帕夫的小金杯的人是？",
    a: "妙麗·格蘭傑"
  },
  {
    q: "紐特・斯卡曼德的上衣口袋裏經常揣著哪種神奇動物？",
    a: "木精(護樹羅鍋)"
  },
  {
    q: "紐特·斯卡曼德的同伴皮奇是哪種魔法生物？",
    a: "玻璃獸"
  },
  {
    q: "紐特·斯卡曼德前往紐約是為了送哪種動物回家？",
    a: "雷鳥"
  },
  {
    q: "紐特·斯卡曼德離開霍格華茲時，他的變形學教授反對學校的懲戒結果使他得以保留魔杖，請問這位教授是？",
    a: "阿不思·鄧不利多"
  },
  {
    q: "紐特‧斯卡曼德在紐約結識的麻瓜是誰？",
    a: "雅各‧科瓦爾斯基"
  },
  {
    q: "紐特受了什麼啟發開始對魔法動物感興趣？",
    a: "他母親養的鷹頭馬身有翼獸（鷹馬）"
  },
  {
    q: "紐特的同伴皮克特是哪種奇獸？",
    a: "木精"
  },
  {
    q: "茶葉占卜是研究什麼的？",
    a: "研究茶葉渣形狀"
  },
  {
    q: "訓練鄧不利多的軍隊成員時，哈利說哪個咒語是巫師的必備咒語？",
    a: "昏擊咒"
  },
  {
    q: "馬份用於詛咒鄧不利多的項鏈最後讓誰遭受了詛咒？",
    a: "凱娣·貝爾"
  },
  {
    q: "假瘋眼漢穆迪在懲罰馬份時，把他變成了？",
    a: "白鼬"
  },
  {
    q: "偉大的阿不思·鄧不利多教授全名是什麼？",
    a: "阿不思·博知維·巫服利·布萊恩·鄧不利多"
  },
  {
    q: "參加三巫鬥法大赛的選手必须年滿多少周歲？",
    a: "17周歲"
  },
  {
    q: "參加史拉轟教授晚宴的成員們加入了什麼團體？",
    a: "史拉俱樂部"
  },
  {
    q: "參與三巫鬥法大賽的人中犧牲的是誰？",
    a: "西追·迪哥裡"
  },
  {
    q: "參賽者挑戰的龍",
    a: "西追：瑞典短吻龍"
  },
  {
    q: "參賽者挑戰的龍",
    a: "花兒：威爾斯綠龍"
  },
  {
    q: "參賽者挑戰的龍",
    a: "喀浪：中國火球龍"
  },
  {
    q: "參賽者挑戰的龍",
    a: "哈利：匈牙利角尾龍"
  },
  {
    q: "啊不拉薩·馬份的死因是什麼？",
    a: "龍痘瘡"
  },
  {
    q: "密室最初的用途是什麼？",
    a: "教授黑魔法"
  },
  {
    q: "從哪本書可以學習到撕淌三步殺?",
    a: "《高級魔藥製作》"
  },
  {
    q: "從哪裡可以搭乘霍格華茲特快車去往霍格華茲?",
    a: "王十字車站，9 3/4月臺。"
  },
  {
    q: "接納之筆將可入學的英國小巫師記錄在什麼上？",
    a: "收錄冊"
  },
  {
    q: "接骨木魔杖的別稱",
    a: "死神魔杖、命運魔杖"
  },
  {
    q: "接骨木魔杖的別稱中不包括什麼？",
    a: "智慧杖"
  },
  {
    q: "接骨木魔杖的杖芯是什麼？",
    a: "騎士墮鬼馬的尾毛"
  },
  {
    q: "接骨木魔杖倒數第二個主人是誰?",
    a: "跩哥‧馬份"
  },
  {
    q: "斜角巷上哪一家酒巴被巫師公認為倫敦最古老的酒吧？",
    a: "破釜酒吧"
  },
  {
    q: "斜角巷裡，專門販售大釜的店由誰經營？",
    a: "派特奇女士"
  },
  {
    q: "猜猜看，以前奈威·隆巴頓教授的寵物蟾蜍名叫什麼？",
    a: "吹寶(萊福)"
  },
  {
    q: "猜猜看，金妮·衛斯理的迷你毛毛球叫什麼名字？",
    a: "阿諾"
  },
  {
    q: "猜猜看，金妮·衛斯理的蒲絨絨(迷你毛毛球)叫什麼名字？",
    a: "阿洛(阿囡)"
  },
  {
    q: "猜猜看，哈利·波特的摯友榮恩·衛斯理最擅長哪一種遊戲？",
    a: "迷你巫師(巫師棋)"
  },
  {
    q: "猜猜看，哈利第一次去路平教授辦公室時，在角落看到了什麼？",
    a: "滾帶落"
  },
  {
    q: "猜猜看，海格的摩托車原來屬於誰？",
    a: "天狼星·布萊克"
  },
  {
    q: "猜猜看，爲什麽鳥蛇蛋這麽值錢？",
    a: "它們是銀做的"
  },
  {
    q: "猜猜看，路平教授的朋友們叫他什麽？",
    a: "月影"
  },
  {
    q: "現今還有多少純血巫師家族？",
    a: "28"
  },
  {
    q: "現存最強勁的愛情魔藥是什麽？",
    a: "意亂情迷水"
  },
  {
    q: "眾所周知，皮皮鬼最怕哪個幽靈?",
    a: "血腥男爵"
  },
  {
    q: "第一任英國魔法部部長是誰?",
    a: "尤裡克‧甘普"
  },
  {
    q: "第一次騎著掃帚飛越大西洋的巫師使用的是什麼型號的飛天掃帚?",
    a: "橡木柄七九"
  },
  {
    q: "第一隻金探子的製作者是誰？",
    a: "鮑曼‧萊特"
  },
  {
    q: "第一顆金探子製作者(鮑曼·賴特)的居住地？",
    a: "高錐客洞 "
  },
  {
    q: "第二學年，哈利·波特和榮恩·衛斯理是通過什麼方式到達學校的？",
    a: "魔法汽車"
  },
  {
    q: "第二學年後的暑假榮恩·衛斯理用了什麼工具聯繫哈利，又對此聯繫感到抱歉？",
    a: "電話"
  },
  {
    q: "莉莉·伊凡第一個認識的巫師是誰？",
    a: "賽佛勒斯·石內卜"
  },
  {
    q: "莉莉·伊凡曾贈予史拉轟教授什麼東西？",
    a: "一朵變成魚的花"
  },
  {
    q: "被食死人抓住後，是誰給哈利波特施了螫人咒？",
    a: "妙麗·格蘭傑"
  },
  {
    q: "通往魔法石的關卡中，巫師棋這一關是誰設定的？",
    a: "麥教授"
  },
  {
    q: "速速前可以招來何種生物？",
    a: "黏巴蟲"
  },
  {
    q: "速速前唯一可以召來的活物是什麼？",
    a: "黏巴蟲"
  },
  {
    q: "鳥頭又被稱為舟形鳥頭和什麼？",
    a: "牛扁"
  },
  {
    q: "麥朵因什麼生物而死？",
    a: "蛇妖"
  },
  {
    q: "麥朵是被誰殺死的？",
    a: "佛地魔"
  },
  {
    q: "麥米奈娃年輕時的戀人，和她的父親一樣是一位？",
    a: "麻瓜"
  },
  {
    q: "麥教授的化獸師形態是什麼？",
    a: "虎斑貓"
  },
  {
    q: "麥教授是哪門課的老師？",
    a: "變形課"
  },
  {
    q: "麥教授曾是哪個學院的院長?",
    a: "葛來分多"
  },
  {
    q: "麥教授曾經被什麼擊中，進了聖蒙果醫院？",
    a: "她被四發昏擊咒擊中"
  },
  {
    q: "麥教授認為最不科學的學科是什麼？",
    a: "占卜學"
  },
  {
    q: "麥教授認為最危險的學科是什麼？",
    a: "變形學"
  },
  {
    q: "麥教授認為霍格華茲最不準確的學科是什麼？",
    a: "占卜學"
  },
  {
    q: "最初和最終，哈利乘坐什麼交通工具來到及離開水蠟樹街4號的？",
    a: "天狼星·布萊克的摩托車"
  },
  {
    q: "最後一個被摧毀的分靈體是什麼？",
    a: "娜吉妮"
  },
  {
    q: "最後大決戰中，哈利·波特在哪裡陷入假死？",
    a: "禁忌森林"
  },
  {
    q: "最終，鄧不利多教授被殺害的地方是哪裡？",
    a: "天文塔"
  },
  {
    q: "喜歡讀雜誌的同學，有人知道哈利的表哥叫什麼名字嗎?",
    a: "達力"
  },
  {
    q: "惡人掌被刺激後會噴出什麼?",
    a: "臭樹汁"
  },
  {
    q: "惡人掌據推測產自哪裡?",
    a: "亞述"
  },
  {
    q: "惡閃鴉的毒液經過稀釋會有什麼效果？",
    a: "消除不好的記憶"
  },
  {
    q: "斯內普的守護神咒和誰的一樣？",
    a: "莉莉·伊凡"
  },
  {
    q: "斯拉格霍恩創辦了什麼協會？",
    a: "鼻涕蟲(史拉)俱樂部"
  },
  {
    q: "普通巫術等級測驗總共有幾個科目？",
    a: "12"
  },
  {
    q: "曾為柯羅奇/克勞奇家族服務過的家庭小精靈是誰？",
    a: "閃閃"
  },
  {
    q: "曾為柯羅奇家族服務的家庭小精靈是？",
    a: "眨眨"
  },
  {
    q: "曾被藏在霍格華茲的魔法石是誰製作的？",
    a: "尼可·勒(樂)梅"
  },
  {
    q: "曾經，弗雷和喬治偷偷用什麼偷聽鳳凰會會議？",
    a: "伸縮耳"
  },
  {
    q: "曾經，桃樂絲·恩不里居(桃樂絲·恩不裡居)用什麼物品懲罰哈利和他的同學們？",
    a: "懲罰羽毛筆"
  },
  {
    q: "曾經的人氣明星吉德羅・洛哈最喜歡的顏色是什麼？",
    a: "淡紫色"
  },
  {
    q: "曾經活下來的男孩哈利波特出生於哪裡？",
    a: "高錐客洞"
  },
  {
    q: "曾經參加過四強爭霸賽的花兒·德拉庫爾(花兒·戴樂古)的妹妹叫什麼？",
    a: "加布麗 / 佳兒"
  },
  {
    q: "曾經誰告訴哈利和榮恩有一位女孩死在了盥洗室裡？",
    a: "跩哥·馬份"
  },
  {
    q: "曾關押黑巫師蓋瑞·葛林戴華德的紐蒙迦德，位於哪個國家？",
    a: "奧地利"
  },
  {
    q: "渾拼柳下的樹洞可以通往哪裡？",
    a: "尖叫屋"
  },
  {
    q: "湯姆‧瑞斗在孤兒院時把誰的兔子吊在了天花板上？",
    a: "比利‧史塔 (比利‧斯塔布斯)"
  },
  {
    q: "萊姆斯·路平、天狼星·布萊克、詹姆·波特和彼得·佩迪魯的組合名稱是什麼？",
    a: "劫盜者"
  },
  {
    q: "進入英國魔法部的方式是?",
    a: "將自己沖進馬桶"
  },
  {
    q: "進入魔法部打的電話號碼是多少？",
    a: "62442"
  },
  {
    q: "馭心梅與眾不同的地方在哪裡？",
    a: "顛倒著懸掛在樹上"
  },
  {
    q: "黑夜王在成為佛地魔之前叫什麼名字？",
    a: "湯姆·瑞斗"
  },
  {
    q: "黑暗時期誰向佛地魔出賣了詹姆和莉莉？",
    a: "彼得·佩迪魯"
  },
  {
    q: "傳言妙麗・格蘭傑聞到的愛情魔藥是什麼味道？",
    a: "剛修剪過的草坪、新的羊皮紙和薄荷味牙膏"
  },
  {
    q: "傳聞中，妙麗曾用什麼來形容榮恩的感情?",
    a: "一茶匙"
  },
  {
    q: "傳聞中，波特家族在古靈閣的金庫編號是多少？",
    a: "687"
  },
  {
    q: "傳聞中，哈利·波特的父親詹姆·波特的外號是什麼？",
    a: "鹿角"
  },
  {
    q: "傳聞中，詹姆·波特的化獸師形態是什麼？",
    a: "雄鹿"
  },
  {
    q: "傳聞中「被選中的人」是誰？",
    a: "哈利·波特"
  },
  {
    q: "傳聞中波特家族在古靈閣的金庫編號是多少？",
    a: "687號"
  },
  {
    q: "傳聞中的“被選中的人”是誰？",
    a: "哈利·波特"
  },
  {
    q: "傳聞中的預言廳在哪裡？",
    a: "魔法部"
  },
  {
    q: "傳聞中哈利波特的父親詹姆波特的外號是什麼？",
    a: "鹿角"
  },
  {
    q: "傳聞中哪一個童話故事提到了死神聖物的起源？",
    a: "《三兄弟的傳說》"
  },
  {
    q: "傳說中的混血王子是誰？",
    a: "賽佛勒斯·石內卜"
  },
  {
    q: "奧利凡德不曾用過哪種材料製作魔杖？",
    a: "迷拉的頭髮"
  },
  {
    q: "奧利凡德不曾使用下列哪種杖芯？",
    a: "迷拉(媚娃)的頭髮"
  },
  {
    q: "奧利凡德家族從什麼時候開始製作魔杖?",
    a: "西元前382年"
  },
  {
    q: "奧利凡德家族從何時開始經營魔杖製造事業？",
    a: "前382年"
  },
  {
    q: "奧利凡德魔杖商店創始於哪一年？",
    a: "西元前382年"
  },
  {
    q: "想要成為正氣師，至少需要獲得幾個良好評價以上的N.E.W.Ts證書？",
    a: "5個"
  },
  {
    q: "想要進入雷文克勞交誼廳，你需要先做什麼？",
    a: "解出謎語"
  },
  {
    q: "想要進入魔法部需要在倫敦紅色電話亭中撥打的號碼是？",
    a: "62442"
  },
  {
    q: "意若思鏡名字的詞源來自哪個單詞？",
    a: "desire(慾望)"
  },
  {
    q: "愛哭鬼麥朵是哪個學院的？",
    a: "雷文克勞"
  },
  {
    q: "愛閱讀的同學們，《神奇的我》是誰的自傳？",
    a: "吉德羅·洛哈"
  },
  {
    q: "照妖鏡的作用？",
    a: "顯示你的敵人正在逼近"
  },
  {
    q: "獅尾蠍和火螃蟹交配繁殖會得到什麼？",
    a: "炸尾螺"
  },
  {
    q: "當一個人快死時，喝什麼生物的血可以使其繼續生存下去？",
    a: "獨角獸"
  },
  {
    q: "當年妙麗用什麼方法同時修多門課程？",
    a: "時光器"
  },
  {
    q: "當你打開咆哮信時會發生什麼？",
    a: "被吼叫"
  },
  {
    q: "當哈利因為違反巫師保密法而接受審判時，證人是？(魔法部最終採用了誰的證詞？)",
    a: "阿拉貝拉·費格(費格太太)"
  },
  {
    q: "當哈利波特第一次參加魁地奇比賽時是誰對他的飛天掃帚施用了黑魔法？",
    a: "奎裡納斯‧奎若"
  },
  {
    q: "當桃樂絲·恩不里居(桃樂絲·恩不裡居)從霍格華茲離開時，皮皮鬼用什麼東西攻擊她？",
    a: "拐杖和裝滿了粉筆的襪子"
  },
  {
    q: "當消失的密室被打開時妙麗格蘭傑通過什麼看見了蛇妖？",
    a: "鏡子"
  },
  {
    q: "當記憶球變成紅色意味著什麼？",
    a: "使用者遺忘了什麼"
  },
  {
    q: "當蓋勒特格林德沃打入美國魔法國會時他的身份是什麼？",
    a: "帕西瓦爾·格雷福斯"
  },
  {
    q: "當德思禮侮辱鄧不利多的時候，海格做了什麽？",
    a: "給達利變出了一條豬尾巴"
  },
  {
    q: "當鄧不利多被革除校長職位後，由誰接任了他的職位？",
    a: "桃樂絲·恩不里居(桃樂絲·恩不裡居)"
  },
  {
    q: "禁止濫用麻瓜物品辦公室的主任是誰？",
    a: "亞瑟·衛斯理"
  },
  {
    q: "萬應室在城堡幾樓？",
    a: "8樓"
  },
  {
    q: "萬應室附近的掛毯上山怪穿著什麼？",
    a: "芭蕾舞裙"
  },
  {
    q: "聖蒙果中的一個牌子上寫著：乾淨的大釜可以讓魔藥不變成什麼？",
    a: "毒藥"
  },
  {
    q: "聖蒙果魔法疾病與傷害醫院位於哪裡？",
    a: "倫敦"
  },
  {
    q: "聖蒙果魔法疾病與傷害醫院的院徽是什麼？",
    a: "魔杖和骨頭交叉 "
  },
  {
    q: "聖蒙果魔法傷病醫院位於?",
    a: "倫敦"
  },
  {
    q: "葛來分多的學院幽靈是誰？",
    a: "差點沒頭的尼克"
  },
  {
    q: "葛萊分多的交誼廳曾用過哪個密語？",
    a: "香蕉餡油炸餅"
  },
  {
    q: "詹姆·波特的別稱？",
    a: "鹿角"
  },
  {
    q: "跩哥・馬份用於詛咒鄧不利多的項鏈最後讓誰遭受了詛咒？",
    a: "凱娣·貝爾"
  },
  {
    q: "跩哥・馬份在三強爭霸賽的舞會上的舞伴是誰?",
    a: "潘西·帕金森"
  },
  {
    q: "跩哥·馬份二年級時使用的是什麼型號的飛天掃帚？",
    a: "光輪2001"
  },
  {
    q: "跩哥·馬份用來羞辱妙麗的〝麻種〞是什麼意思？",
    a: "父母都是麻瓜的巫師"
  },
  {
    q: "跩哥·馬份最終與誰結成了夫妻？",
    a: "阿斯托利亞·綠茵"
  },
  {
    q: "跩哥‧馬份在三巫鬥法大賽的聖誕舞會上的舞伴是誰？",
    a: "潘西‧帕金森"
  },
  {
    q: "跩哥‧馬份在消失櫥櫃裡藏過什麼?",
    a: "小鳥"
  },
  {
    q: "路平教授在哈利波特幾年級時來霍格華茲教授黑魔法防禦術？",
    a: "三年級"
  },
  {
    q: "路平教授使用什麼藥水讓自己變身時保持理智？",
    a: "縛狼汁"
  },
  {
    q: "路平教授原以爲哈利的幻形怪會變成什麽形態？",
    a: "佛地魔"
  },
  {
    q: "路平教授最後和誰結婚了?",
    a: "小仙女·東施"
  },
  {
    q: "達力在哪本書裡遇到了催狂魔？",
    a: "鳳凰社"
  },
  {
    q: "雷文克勞交誼廳的門環是什麼形狀？",
    a: "鷹"
  },
  {
    q: "雷文克勞的冠冕底座上刻的格言是？",
    a: "過人的智慧是人類最大的財富"
  },
  {
    q: "雷文克勞的冠冕被湯姆·瑞斗得到前存放在哪個國家的一棵樹的樹洞裡？",
    a: "阿爾巴尼亞"
  },
  {
    q: "雷文克勞的冠冕曾被海蓮娜·雷文克勞藏在哪裡？",
    a: "阿爾巴妮亞森林"
  },
  {
    q: "雷文克勞的學院幽靈是誰?",
    a: "格雷女士"
  },
  {
    q: "雷木思·路平、天狼星·布萊克、詹姆·波特和彼得·佩迪魯的組合名稱是什麼？",
    a: "劫盜者"
  },
  {
    q: "雷木思·路平的別稱？",
    a: "月影"
  },
  {
    q: "雷吉·卡特莫爾在魔法部的哪個部門工作？",
    a: "魔法維護局"
  },
  {
    q: "電影中哈利·波特沒有進入霍格華茲魔法學校之前放出一條什麼蟒蛇？",
    a: "緬甸蟒"
  },
  {
    q: "對抗食死人時，天狼星·布萊克死於誰之手?",
    a: "貝拉·雷斯壯"
  },
  {
    q: "對黑魔法影響頗深，以第一位蛇妖孵化者著稱的最早爬說語之一是？",
    a: "卑鄙的海爾波(惡人赫珀)"
  },
  {
    q: "榮恩・衛斯理的第一根魔杖是怎麼壞掉的？",
    a: "被渾拚柳打斷"
  },
  {
    q: "榮恩·衛斯理一家曾在贏得大獎後去那裡旅遊?",
    a: "埃及"
  },
  {
    q: "榮恩·衛斯理因為迷你巫師勝利為葛來分多加了多少分?",
    a: "50"
  },
  {
    q: "榮恩·衛斯理的父親在哪裡工作？",
    a: "魔法部"
  },
  {
    q: "榮恩·衛斯理的貓頭鷹小豬原來叫什麽名字？",
    a: "豬水鳧"
  },
  {
    q: "榮恩·衛斯理的護法是什麼？",
    a: "傑克羅素犬(傑克拉塞爾獵狗)"
  },
  {
    q: "榮恩·衛斯理最喜歡的魁地奇球隊是什麼隊？",
    a: "查德利砲彈隊"
  },
  {
    q: "榮恩·衛斯理曾在葛來分多魁地奇球隊打什麼位置?",
    a: "看守手"
  },
  {
    q: "榮恩‧衛斯理曾經把什麼生物偽裝成了自己?",
    a: "惡鬼"
  },
  {
    q: "榮恩的第一個女朋友叫什麼？",
    a: "文妲·布朗"
  },
  {
    q: "榮恩的貓頭鷹叫什麼名字？",
    a: "小豬"
  },
  {
    q: "榮恩的寵物老鼠叫什麽名字？",
    a: "斑斑"
  },
  {
    q: "榮恩的護法是什麼動物?",
    a: "傑克羅素犬"
  },
  {
    q: "榮恩的魔杖是什麼原因弄斷的？",
    a: "渾拚柳"
  },
  {
    q: "榮恩缺少的巧克力蛙是哪兩張？",
    a: "康尼留斯·阿葛麗芭和皮托勒米"
  },
  {
    q: "榮恩現影術分體後，妙麗用什麼治療他的傷口？",
    a: "白鮮液"
  },
  {
    q: "榮恩衛斯理家裡的大鐘有什麼用途？",
    a: "顯示家人的狀態"
  },
  {
    q: "榮恩衛斯理最喜歡的魁地奇球隊是什麼隊？",
    a: "查德利砲彈隊"
  },
  {
    q: "榮恩衛斯理曾在葛來分多魁地奇球隊打什麼位置？",
    a: "看守手"
  },
  {
    q: "瑪麗·卡特摩的丈夫雷格·卡特摩曾在魔法部的哪裡工作？",
    a: "魔法維護局"
  },
  {
    q: "瘋眼.穆迪曾如何＂懲罰＂跩哥·馬份？",
    a: "他把跩哥變成了一隻白鼬"
  },
  {
    q: "瘋眼漢穆迪在魔法部擔任什麼職位時受了很多傷？",
    a: "正氣師"
  },
  {
    q: "福來福喜的重要配方之一是哪種生物的蛋殼？",
    a: "兩腳蛇"
  },
  {
    q: "與哈利·波特交好的衛斯理一家曾居住的房子叫什麼？",
    a: "洞穴屋 / 陋居"
  },
  {
    q: "與蛇妖的眼睛對視會發生什麼？",
    a: "死亡"
  },
  {
    q: "蓋勒·葛林戴華德所屬的魔法學校是以下哪個？",
    a: "德姆斯特朗(德姆蘭學院)"
  },
  {
    q: "蓋勒·葛林戴華德曾在哪所學校上學？",
    a: "德姆斯特朗(德姆蘭學院)"
  },
  {
    q: "蓋瑞·葛林戴華德曾潛伏進美國魔法國會，當時他的化名為？",
    a: "帕西瓦爾·格雷夫斯(博知維·格雷維斯)"
  },
  {
    q: "誘餌炸彈有什麼用？",
    a: "吸引火力"
  },
  {
    q: "說出霍格華茲經常出沒的搗亂分子的名字?",
    a: "皮皮鬼"
  },
  {
    q: "赫夫帕夫的學院幽靈是誰？",
    a: "胖修士"
  },
  {
    q: "赫夫帕夫學院的誰被開除過？",
    a: "紐特·斯卡曼德"
  },
  {
    q: "赫敏格蘭傑的守護神是什麼形態？",
    a: "水獺"
  },
  {
    q: "魁地奇比賽中，什麼位置負責擊打搏格？",
    a: "打擊手"
  },
  {
    q: "魁地奇比賽中，常規得分手段是投進什麼球？",
    a: "快浮"
  },
  {
    q: "魁地奇球隊霍利黑德哈比隊，成立於哪一年？",
    a: "1203年"
  },
  {
    q: "魁地奇賽事中追捕手用什麼方式來抓捕金探子？",
    a: "隆斯基詐騙法(朗斯基防禦性假動作)"
  },
  {
    q: "鳳凰的眼淚有什麼功效?",
    a: "療傷治癒"
  },
  {
    q: "鳳凰社總部在哪裡？",
    a: "古裡某街十二號"
  },
  {
    q: "嘿美的名字出自哪裡？",
    a: "《魔法史》"
  },
  {
    q: "德姆斯特朗的長袍顏色是什麼?",
    a: "血紅色"
  },
  {
    q: "德拉科馬份在三強爭霸賽的舞會上的舞伴是誰？",
    a: "潘西·帕金森"
  },
  {
    q: "摩金夫人在斜角巷開了一家什麼店?",
    a: "長袍店"
  },
  {
    q: "衛氏巫師法寶店在斜角巷第幾號？",
    a: "93"
  },
  {
    q: "衛氏巫師法寶店在斜角巷幾號？",
    a: "斜角巷93號 "
  },
  {
    q: "衛氏巫師法寶店最大的投資者是誰？",
    a: "哈利‧波特"
  },
  {
    q: "衛斯理一家去德思禮家接哈利看世界賽時使用了什麼移動方式？",
    a: "呼嚕網"
  },
  {
    q: "衛斯理一家所在的村子叫什麼?",
    a: "凱奇波"
  },
  {
    q: "衛斯理太太曾給哈利織過什麼顏色的毛衣？",
    a: "藍色"
  },
  {
    q: "衛斯理夫人從沒覺得誰會死去？",
    a: "弗雷"
  },
  {
    q: "衛斯理兄弟用藥水成功把名字放進火盃後發生了什麼？",
    a: "他們變老了"
  },
  {
    q: "衛斯理兄弟在誰的辦公室抽屜發現了劫盜地圖？",
    a: "阿各·飛七"
  },
  {
    q: "衛斯理家兄弟排名第五的是誰?",
    a: "喬治·衛斯理"
  },
  {
    q: "衛斯理家兄弟排名第四的是誰？",
    a: "喬治·衛斯理"
  },
  {
    q: "衛斯理速效逃課糖會讓使用者怎麽樣？",
    a: "看上去生病了"
  },
  {
    q: "衛斯理摸魚點心盒會讓食用者怎麼樣？",
    a: "看上去生病了"
  },
  {
    q: "衛斯理雙子的護法是什麼?",
    a: "喜鵲"
  },
  {
    q: "衛斯理雙胞胎準備怎麼跨過火盃的年齡線？",
    a: "使用增齡劑"
  },
  {
    q: "誰反對把皮皮鬼趕出城堡？",
    a: "胖修士"
  },
  {
    q: "誰用的杖芯材料是山怪的鬍鬚？",
    a: "卡多甘爵士"
  },
  {
    q: "誰用假掛墜替換了岩洞中的真掛墜？",
    a: "獅子阿爾發·布萊克"
  },
  {
    q: "誰在危機時刻趕到密室幫助了哈利？",
    a: "佛客使"
  },
  {
    q: "誰在阿辣哥的葬禮上發表了講話？",
    a: "赫瑞司·史拉轟"
  },
  {
    q: "誰在哈利·波特額頭上留下了閃電疤痕？",
    a: "佛地魔"
  },
  {
    q: "誰在第二次巫師世界大戰用雙面鏡幫助哈利？",
    a: "阿波夫.鄧不利多"
  },
  {
    q: "誰在霍格華茲特快車上對哈利施了全身鎖咒？",
    a: "跩哥·馬份"
  },
  {
    q: "誰在霍格華茲第一學年就對奈威隆巴頓釋放過石化咒？",
    a: "妙麗·格蘭傑"
  },
  {
    q: "誰死在了英國魔法部神秘部門(神秘事物司)的簾幕後面？",
    a: "天狼星·布萊克"
  },
  {
    q: "誰告訴了哈利、榮恩、妙麗死神聖物的故事?",
    a: "贊諾·羅古德(謝諾菲留斯·諾夫古德)"
  },
  {
    q: "誰告訴哈利盥洗室是通往密室的入口？",
    a: "跩哥·馬份"
  },
  {
    q: "誰把湯姆·瑞斗的日記放入金妮的大釜？",
    a: "魯休斯·馬份"
  },
  {
    q: "誰和哈利·波特一起參加了史拉轟教授的聖誕晚會？",
    a: "露娜·羅古德"
  },
  {
    q: "誰的冠冕成了佛地魔的分靈體？",
    a: "羅威娜·雷文克勞"
  },
  {
    q: "誰的掛墜成了佛地魔的分靈體？",
    a: "薩拉紮·史萊哲林"
  },
  {
    q: "誰的辦公室曾經使用過「檸檬雪寶糖」這個密語？",
    a: "鄧不利多教授"
  },
  {
    q: "誰的魔杖內芯是山怪毛？",
    a: "卡多甘爵士"
  },
  {
    q: "誰的魔眼能看穿牆壁?",
    a: "阿拉特·穆敵"
  },
  {
    q: "誰是布萊克家族的家庭小精靈？",
    a: "怪角(克利切)"
  },
  {
    q: "誰是哈利·波特的第三任黑魔法防禦術老師？",
    a: "雷木思·路平 / 萊姆斯‧路平"
  },
  {
    q: "誰是哈利波特入學第一學期魁地奇隊長？",
    a: "奥利佛·木透"
  },
  {
    q: "誰是霍格華茲的鑰匙和場地管理員?",
    a: "魯霸·海格"
  },
  {
    q: "以下誰是默然者？",
    a: "克萊登斯·巴瑞波恩 (魁登斯·巴波)"
  },
  {
    q: "誰派多比前往馬分莊園的地窖解救了哈利·波特和他的朋友們?",
    a: "阿波佛·鄧不利多"
  },
  {
    q: "誰為了誤導魔法部對天狼星‧布萊克的搜捕方向說他曾出現在西藏？",
    a: "金利‧俠鉤帽"
  },
  {
    q: "誰為學院魁地奇球隊採購了全部的掃帚？",
    a: "魯休斯·馬份"
  },
  {
    q: "誰能告訴我，高布石(多多石)像麻瓜的哪種遊戲？",
    a: "彈球"
  },
  {
    q: "誰能說出糞石取自何處？",
    a: "山羊的胃"
  },
  {
    q: "誰假冒了真正的阿拉特・穆迪作為三巫鬥法大賽那年霍格華茲的黑魔法防禦術教授？",
    a: "小巴堤·柯羅奇(小巴蒂·克勞奇)"
  },
  {
    q: "誰教會了哈利·波特護法咒？",
    a: "路平"
  },
  {
    q: "誰第一個告訴哈利·波特，他是一個巫師?",
    a: "海格"
  },
  {
    q: "誰終結了貝拉‧雷斯壯？",
    a: "茉莉‧衛斯理"
  },
  {
    q: "誰終結了娜吉妮？",
    a: "奈威"
  },
  {
    q: "誰終結了鄧不利多的生命？",
    a: "石內卜教授"
  },
  {
    q: "誰最先找到史萊哲林的小金匣？",
    a: "獅子阿爾發・布萊克(雷古勒斯·布萊克)"
  },
  {
    q: "誰創建了S.P.E.W？",
    a: "妙麗·格蘭傑"
  },
  {
    q: "誰曾因為喝下了錯誤的變身藥水變成了貓人？",
    a: "妙麗·格蘭傑"
  },
  {
    q: "誰曾在魁地奇比賽中，戴了一頂獅子頭形狀還會吼叫的帽子？",
    a: "露娜·羅古德"
  },
  {
    q: "誰曾是魔法部派往霍格華茲的總督察？",
    a: "桃樂絲·恩不里居(桃樂絲·恩不裡居)"
  },
  {
    q: "誰曾經使用時光器（時間轉換器）解決課程時間衝突的問題？",
    a: "妙麗·格蘭傑"
  },
  {
    q: "誰發明了咒語撕淌三步殺？",
    a: "賽佛勒斯·石內卜"
  },
  {
    q: "誰預言了一個七月出生的男孩將挑戰佛地魔？",
    a: "西碧·崔老妮"
  },
  {
    q: "誰摧毀了佛地魔的最後一個分靈體？",
    a: "奈威·隆巴頓"
  },
  {
    q: "誰誣陷海格打開了密室？",
    a: "湯姆·瑞斗"
  },
  {
    q: "誰導致了巴嘴被判了死刑？",
    a: "魯休斯‧馬份"
  },
  {
    q: "誰調換了佛地魔藏在岩洞中的史萊哲林小金匣？",
    a: "獅子阿爾發·布萊克"
  },
  {
    q: "誰養了一隻叫拿樂絲太太的貓？",
    a: "阿各·飛七"
  },
  {
    q: "誰幫助哈利、榮恩和妙麗溜進古靈閣？",
    a: "拉環"
  },
  {
    q: "誰還記得哈利·波特的第一根魔杖有多長？",
    a: "11吋"
  },
  {
    q: "請問「黏痰過多」裡的黏痰指的是？",
    a: "花兒·德拉庫爾 (花兒·戴樂古)"
  },
  {
    q: "請問在第三學年時哈利波特用什麼樣的方式從姨媽家來到斜角巷？",
    a: "乘坐騎士公車"
  },
  {
    q: "請問紐特·斯卡曼德給蒂娜·戈德斯坦的情書中寫到蒂娜的眼睛像哪種生物？",
    a: "火蜥蜴"
  },
  {
    q: "請問接骨木魔杖的第一代主人是誰？",
    a: "安提歐·皮福雷"
  },
  {
    q: "請問隆巴頓教授在上學的時候養了什麼寵物？",
    a: "蟾蜍"
  },
  {
    q: "請問學院幽靈灰衣貴婦的原名是？",
    a: "海蓮娜‧雷文克勞"
  },
  {
    q: "請問學院幽靈格雷女士的原名是？",
    a: "海蓮娜·雷文克勞"
  },
  {
    q: "請問變身水的配方沒有以下哪一樣？",
    a: "粉碎蛇的毒牙"
  },
  {
    q: "鄧不利多在青年時期最好的朋友是誰？",
    a: "蓋勒葛林戴華德"
  },
  {
    q: "鄧不利多死的那天晚上，是什麼文物讓食死人進入霍格華茲?",
    a: "消失衣櫃"
  },
  {
    q: "鄧不利多告訴妙麗可以利用時光器拯救兩條生命時，他指的誰?",
    a: "天狼星·布萊克和巴嘴"
  },
  {
    q: "鄧不利多沒有使用過什麼作為密語？",
    a: "南瓜汁"
  },
  {
    q: "鄧不利多和葛林戴華德在哪裡認識的？",
    a: "高錐克洞"
  },
  {
    q: "鄧不利多和葛林戴華德曾在哪裡結下血盟？",
    a: "穀倉"
  },
  {
    q: "鄧不利多的母親叫什麼名字？",
    a: "坎德拉・鄧不利多"
  },
  {
    q: "鄧不利多的軍隊的第一次集會地點選擇在了哪裡？",
    a: "豬頭酒吧"
  },
  {
    q: "鄧不利多的軍隊通過什麼硬幣來交流資訊？",
    a: "假加隆"
  },
  {
    q: "鄧不利多的鳳凰的名字叫什麼？",
    a: "佛客使"
  },
  {
    q: "鄧不利多將什麼遺贈給妙麗？",
    a: "《吟遊詩人皮陀故事集》"
  },
  {
    q: "鄧不利多將分靈體上的詛咒壓制在了自己身體的哪個部位?",
    a: "右手"
  },
  {
    q: "鄧不利多帶著哈利邀請赫瑞司·史拉轟的時候，他變成了什麼?",
    a: "扶手椅"
  },
  {
    q: "鄧不利多教授學生時被分到了哪個學院？",
    a: "葛來分多"
  },
  {
    q: "鄧不利多第一次見到湯姆·瑞斗是在什麼地方？",
    a: "伍爾斯孤兒院"
  },
  {
    q: "鄧不利多逝世後，熄燈器的持有者是誰？",
    a: "榮恩‧衛斯理"
  },
  {
    q: "鄧不利多最後一次與哈利見面的地方？",
    a: "王十字車站"
  },
  {
    q: "鄧不利多曾在意若思鏡裡藏了什麼？",
    a: "魔法石"
  },
  {
    q: "鄧不利多曾經擁有幾件死亡聖器？",
    a: "3"
  },
  {
    q: "鄧不利多與葛林戴華德在什麼時候因什麼決裂？",
    a: "1899年在兩人的爭吵中阿利安娜突然死亡"
  },
  {
    q: "鄧不利多屬於哪個學院？",
    a: "葛萊分多"
  },
  {
    q: "魯霸·海格同父異母的弟弟叫什麼名字？",
    a: "呱啦"
  },
  {
    q: "魯霸·海格的小龍蘿蔔托付給查理之後改名爲什麽？",
    a: "諾貝塔"
  },
  {
    q: "魯霸·海格的父母中誰是巨人？",
    a: "母親是巨人"
  },
  {
    q: "魯霸‧海格上學的時候，誰是他最好的朋友？",
    a: "阿辣哥"
  },
  {
    q: "魯霸‧海格在霍格華茲就讀幾年級時，因為密室事件而被學校開除?",
    a: "三年級"
  },
  {
    q: "學生們在課上被毒觸手攻擊可以做什麽？",
    a: "大聲念咒"
  },
  {
    q: "學生時哈利的職業規劃是什麼?",
    a: "正氣師"
  },
  {
    q: "學生時期，妙麗曾用衝衝攻攻擊過榮恩，你們知道為什麼嗎?",
    a: "他親了文妲·布朗"
  },
  {
    q: "學生時期的西莫·斐尼干的幻形怪型態是什麼？",
    a: "報喪女妖"
  },
  {
    q: "學生時期的佛地魔湯姆·瑞斗被分到哪個學院？",
    a: "史萊哲林"
  },
  {
    q: "學生時期的魯霸·海格在地牢養大了一隻八眼巨蛛，它的名字叫？",
    a: "阿辣哥"
  },
  {
    q: "學生時期哈利的職業規劃是什麼？",
    a: "正氣師"
  },
  {
    q: "學院幽靈中是誰一直反對將皮皮鬼趕出雀格華茲？",
    a: "胖修士"
  },
  {
    q: "學院幽靈差點沒頭的尼克的本名是什麼?",
    a: "尼古拉斯·德·敏西·波平頓"
  },
  {
    q: "學期結束時，學院分最高的學院會贏得什麼榮譽？",
    a: "學院杯"
  },
  {
    q: "據茉莉所知，亞瑟·衛斯理的最大理想是什麼？",
    a: "弄清飛機是怎麼呆在天上的"
  },
  {
    q: "歷史上，是誰摧毀了分靈體魔佛羅·剛特(岡特)的戒指？",
    a: "阿不思·鄧不利多"
  },
  {
    q: "歷史上，娜吉妮在變成蛇之前與誰關係密切？",
    a: "克萊登斯·巴瑞波恩"
  },
  {
    q: "歷史上，湯姆·瑞斗誣衊誰打開了密室？",
    a: "魯霸·海格"
  },
  {
    q: "歷史上，葛萊分多交誼廳入口在胖夫人受到驚嚇後，由誰臨時守護？",
    a: "卡多甘爵士"
  },
  {
    q: "歷史上，赫夫帕夫的金杯由誰親手摧毀？",
    a: "妙麗·格蘭傑"
  },
  {
    q: "歷史上，誰打敗了一代黑魔王蓋勒・葛林戴華德？",
    a: "阿不思·鄧不利多"
  },
  {
    q: "歷史上，鄧不利多的軍隊的常規訓練地點在哪裡？",
    a: "萬應室"
  },
  {
    q: "歷史上妙麗·格蘭傑熬製的第一份魔藥叫什麼?",
    a: "治療疥瘡的藥水"
  },
  {
    q: "歷史軼聞，誰將劫盜地圖送給了哈利？",
    a: "弗雷和喬治"
  },
  {
    q: "獨角獸寶寶是什麼顏色？",
    a: "金色"
  },
  {
    q: "貓頭鷹是值得信賴的寵物，有誰知道哈利·波特的貓頭鷹叫什麼？",
    a: "嘿美"
  },
  {
    q: "貓頭鷹愛好者們，知道哈利的貓頭鷹嘿美是什麼品種嗎？",
    a: "雪鴞"
  },
  {
    q: "貓頭鷹愛好者請聽題，愛落(埃羅爾)是誰的貓頭鷹?",
    a: "衛斯理一家"
  },
  {
    q: "霍格莫德妖精叛亂的時間是？",
    a: "1612年"
  },
  {
    q: "霍格華茲一年級新生不被允許帶什麼入校？",
    a: "飛天掃帚"
  },
  {
    q: "霍格華茲女生盥洗室裡游蕩著哪位幽靈？",
    a: "麥朵"
  },
  {
    q: "霍格華茲女生盥洗室裡總有鬼出沒？",
    a: "桃金孃(麥朵)"
  },
  {
    q: "霍格華茲不允許學生帶什麼寵物入學？",
    a: "八眼巨蛛"
  },
  {
    q: "霍格華茲之戰中，是誰斬斷了娜吉妮的頭？",
    a: "奈威‧隆巴頓"
  },
  {
    q: "霍格華茲之戰開戰前，誰召集了食死人？",
    a: "阿萊克托·卡羅(艾朵·卡羅)"
  },
  {
    q: "霍格華茲主樓內會轉動的樓梯是以下哪位學院創始人的傑作?",
    a: "羅威娜‧雷文克勞"
  },
  {
    q: "霍格華茲共有幾道樓梯？",
    a: "142"
  },
  {
    q: "霍格華茲各學院的學院杯分數是用什麼記錄的？",
    a: "裝滿寶石的沙漏"
  },
  {
    q: "霍格華茲的飛行課教師是誰？",
    a: "胡奇夫人"
  },
  {
    q: "霍格華茲的哪一任校長曾經是著名的草藥學家？",
    a: "費麗·斯波兒"
  },
  {
    q: "霍格華茲的家庭小精靈又把萬應室稱為什麼？",
    a: "來去屋"
  },
  {
    q: "霍格華茲的第一任管理員是誰？",
    a: "漢克爾頓·亨布爾"
  },
  {
    q: "霍格華茲的圖書館管理員是誰？",
    a: "平思(平斯)女士"
  },
  {
    q: "霍格華茲的學生通常在斜腳巷哪裡購買校袍?",
    a: "摩金夫人長袍專賣店"
  },
  {
    q: "霍格華茲的學生給露娜·羅古德起了什麼外號？",
    a: "瘋姑娘露娜 / 露瘋子羅古德"
  },
  {
    q: "霍格華茲的獵場看守是誰？",
    a: "魯霸·海格"
  },
  {
    q: "霍格華茲保衛戰發生在哪一年?",
    a: "1998"
  },
  {
    q: "霍格華茲城堡坐落在什麼地方？",
    a: "蘇格蘭高地"
  },
  {
    q: "霍格華茲特快車上賣零食的女售貨員叫什麼名字？",
    a: "沒人知道"
  },
  {
    q: "霍格華茲特快車出現以前，霍格華茲的學生們如何去學校？",
    a: "港口鑰"
  },
  {
    q: "霍格華茲特快車從哪個車站出發？",
    a: "王十字車站"
  },
  {
    q: "霍格華茲唯一的幽靈教授是誰？",
    a: "丙斯教授"
  },
  {
    q: "霍格華茲規定新生的天秤材質？",
    a: "黃銅"
  },
  {
    q: "霍格華茲通往活米村(霍格莫德)的密道藏在哪裡？",
    a: "駝背獨眼女巫雕像後面"
  },
  {
    q: "霍格華茲最高的塔樓是什麼？",
    a: "天文塔"
  },
  {
    q: "霍格華茲魁地奇球賽的裁判是誰？",
    a: "胡奇女士"
  },
  {
    q: "霍格華茲歷史上，誰在萬應室放出了惡魔之火？",
    a: "文森特·克拉布(文森克拉)"
  },
  {
    q: "霍格華茲歷史上最年輕的校長是誰？",
    a: "賽佛勒斯‧石內卜"
  },
  {
    q: "龍血的十二種用途的發現者是誰？",
    a: "阿不思·鄧不利多"
  },
  {
    q: "儲思盆裡的物質是什麼樣子的？",
    a: "混濁液體/氣體"
  },
  {
    q: "儲思盆裡面盛裝著什麼？",
    a: "非液體非氣體"
  },
  {
    q: "薇朵教授在霍格華茲教哪一門課程？",
    a: "算數占卜"
  },
  {
    q: "衛斯理先生對衛斯理太太的愛稱是什麼?",
    a: "茉莉小顫顫"
  },
  {
    q: "是誰告訴哈利有密室的?",
    a: "多比"
  },
  {
    q: "歷史上誰沒有從阿茲卡班越獄過?",
    a: "伊戈爾‧卡卡洛夫 / 伊果‧卡卡夫"
  },
  {
    q: "桃樂絲·恩不裡居戴的吊墜盒上的「S」被她稱為?",
    a: "塞爾溫家族"
  },
  {
    q: "小天狼星的母親叫什麼?",
    a: "沃爾布加‧布萊克 / 瓦柏嘉‧布萊克"
  },
  {
    q: "石內卜教授曾經佈置關於狼人的論文有多長?",
    a: "至少兩張羊皮紙"
  },
  {
    q: "麻瓜傳說中的麥田圈可能是哪種奇獸留下的?",
    a: "拜月獸"
  },
  {
    q: "衛斯理家族中的雙胞胎兄弟出生於哪個節日?",
    a: "愚人節"
  },
  {
    q: "以下哪種魔法生物被認為是虛構的?",
    a: "泡泡鼻涕怪"
  },
  {
    q: "麥教授丈夫的名字是什麼?",
    a: "埃爾芬斯通‧厄克特"
  },
  {
    q: "隨意敲擊赫夫帕夫交誼廳門口的大桶會如何?",
    a: "被淋一身醋"
  },
  {
    q: "洛哈特最喜歡的顏色是什麼?",
    a: "丁香色"
  },
  {
    q: "哪個不是哈利波特在洛哈特教授課堂上被迫演的角色?",
    a: "一個家庭小精靈"
  },
  {
    q: "古靈閣地下瀑布有什麼作用?",
    a: "洗去所有的魔咒和魔法偽裝"
  },
  {
    q: "假穆迪教授在課堂上用什麼演示了不赦咒?",
    a: "蜘蛛"
  },
  {
    q: "霍格華茲校長辦公室門口的雕像是什麼？",
    a: "石像鬼"
  },
  {
    q: "謝諾菲留斯·洛夫古德認為旋舞針的翅膀能引發什麼？",
    a: "導入高級思維狀態"
  },
  {
    q: "謝諾菲留斯·洛夫古德認為馭心梅可以加強人對什麼東西的感知能力?",
    a: "異常事物"
  },
  {
    q: "賽佛勒斯·石內卜少年時代曾被自己發明哪種咒語所捉弄？",
    a: "倒倒吊"
  },
  {
    q: "賽佛勒斯·石內卜幼時的家在哪條街上？",
    a: "紡紗街"
  },
  {
    q: "賽佛勒斯·石內卜在舊《高級魔藥製作》課本曾署名什麼？",
    a: "混血王子"
  },
  {
    q: "賽佛勒斯·石內卜在舊《進階魔藥調配學》課本裡曾署名什麼？",
    a: "混血王子"
  },
  {
    q: "賽佛勒斯·石內卜死後的下一任魔藥學教授是？",
    a: "赫瑞司‧史拉轟"
  },
  {
    q: "賽佛勒斯·石內卜的母親是哪位家族的後代?",
    a: "普林斯家族"
  },
  {
    q: "賽佛勒斯·石內卜教授的母親叫什麼？",
    a: "愛琳·普林斯"
  },
  {
    q: "賽佛勒斯·石內卜最後死於哪裡？",
    a: "尖叫屋"
  },
  {
    q: "賽佛勒斯·石內卜學生時代被起什麼外號？",
    a: "鼻涕卜"
  },
  {
    q: "賽佛勒斯·石內卜擔任校長的時候，史萊哲林的院長是誰？",
    a: "赫瑞司·史拉轟"
  },
  {
    q: "雙角獸可以在哪裡被發現？",
    a: "瑞典"
  },
  {
    q: "騎士公車的售票員叫什麼名字?",
    a: "斯坦利・桑派克(史坦・桑派)"
  },
  {
    q: "爆尾釘蝦是火螃蟹和什麼生物的雜交後代？",
    a: "人面蠍尾獅"
  },
  {
    q: "爆角怪的角有什麽特別之處？",
    a: "會引起爆炸"
  },
  {
    q: "羅恩韋斯萊兒時的家叫什麼名字？",
    a: "陋室"
  },
  {
    q: "羅梅塔夫人把施了毒咒的寶石項鍊給了誰？",
    a: "凱娣·貝爾"
  },
  {
    q: "露娜·羅古德女士曾屬於哪個學院?",
    a: "雷文克勞"
  },
  {
    q: "露娜·羅古德父親的職業是什麼？",
    a: "《謬論家》的主編"
  },
  {
    q: "露娜·羅古德的護法是什麼型態？",
    a: "野兔"
  },
  {
    q: "露娜·羅古德透過七彩迷幻眼鏡可以看到什麼？",
    a: "嗡嗡靈"
  },
  {
    q: "露娜的父親是哪份報紙的主編?",
    a: "《謬論家》"
  },
  {
    q: "露娜認為哪種植物可以用於驅趕大嘴彩球魚貪吃長腿魚？",
    a: "戈迪根"
  },
  {
    q: "魔法史課上，同學們總是把惡魔埃默里克和誰搞混？",
    a: "怪胎烏瑞克"
  },
  {
    q: "魔法石可以帶來什麼？",
    a: "永生"
  },
  {
    q: "魔法石事件後，鄧布利多在校醫處探望哈利時吃了什麼口味的柏蒂全口味豆？",
    a: "耳垢味"
  },
  {
    q: "魔法石是什麼顏色的？",
    a: "紅色"
  },
  {
    q: "魔法石曾被存放於古靈閣的幾號金庫？",
    a: "713號"
  },
  {
    q: "魔法部的魔法兄弟噴泉不包含以下哪種雕塑？",
    a: "火龍/黑妖精"
  },
  {
    q: "魔法部將一種生物定級為X級時，意味著什麼？",
    a: "惹人煩惱的 / 幾乎沒有殺傷力 / 幾乎沒有威力"
  },
  {
    q: "魔法部將一種生物定級為XXX級時，意味著什麼？",
    a: "有能力的巫師可以戰勝"
  },
  {
    q: "魔柔·剛特將史萊哲林小金匣賣了多少錢？",
    a: "10加隆"
  },
  {
    q: "聽說露娜·羅古德女士總穿著鞋睡覺，大家知道為什麼嗎?",
    a: "她會夢遊"
  },
  {
    q: "鷹頭馬身有翼獸巴克比克回到霍格沃茲後海格給他取了一個新名字是什麼？",
    a: "威瑟溫斯"
  },
  {
    q: "阿不思‧鄧不利多的母親是？",
    a: "坎德拉‧鄧不利多"
  },
  {
    q: "霍格莫德的創建者是誰？",
    a: "漢吉斯"
  },
  {
    q: "活米村的創建者是誰？",
    a: "漢吉斯"
  },
  {
    q: "是誰導致了麥朵的離世？",
    a: "蛇妖"
  },
  {
    q: "威農·德斯禮所在的公司的名字是什麼？",
    a: "格朗寧"
  },
  {
    q: "誰是第一個成功製作出分靈體的巫師？",
    a: "卑鄙的海爾波"
  },
  {
    q: "麥教授的化獸師變形的異常在哪裡？",
    a: "眼部眼鏡形狀花紋"
  },
  {
    q: "露娜的護法是什麼？",
    a: "可愛的野兔"
  },
  {
    q: "石內卜教授最想教授什麼課程？",
    a: "黑魔法防禦術"
  },
  {
    q: "哈利波特和榮恩第一次在火車上見面時，雙胞胎正準備去看什麼？",
    a: "蜘蛛"
  },
  {
    q: "代課老師葛柏蘭教授的名字叫什麼？",
    a: "威爾米娜"
  },
  {
    q: "哈利與榮恩拿著戲法魔杖在變形課上比劍術之後，哈利的假魔杖變成了什麼？",
    a: "橡皮的黑線鱈魚"
  },
  {
    q: "哈利‧波特用什麼摧毀了佛地魔的日記本？",
    a: "蛇妖的毒牙"
  },
  {
    q: "鄧不利多教授的鼻子看起來斷了幾次？",
    a: "至少兩次"
  },
  {
    q: "海格在什麼節日裡親吻過麥教授？",
    a: "耶誕節"
  },
  {
    q: "海葵鼠汁的主要用途是什麼？",
    a: "治療傷口"
  },
  {
    q: "賽佛勒斯‧石內卜誤傷喬治‧衛斯理的撕淌三步殺其實是為了保護誰？",
    a: "雷木思‧路平 / 萊姆斯‧路平"
  },
  {
    q: "哈利‧波特曾在廁所拿什麼咒語將跩哥馬份打傷？",
    a: "撕淌三步殺"
  },
  {
    q: "去活米村有什麼前提？",
    a: "有監護人許可"
  },
  {
    q: "當密室被打開時，妙麗‧格蘭傑通過什麼看見了蛇妖？",
    a: "鏡子"
  },
  {
    q: "三巫鬥法大賽上，哈利‧波特在第二輪獲得了第幾名？",
    a: "2"
  },
  {
    q: "最初是誰發現了哈利‧波特是一名天生的魁地奇球手？",
    a: "麥米奈娃"
  },
  {
    q: "哈利‧波特第一次去海格家吃了什麼？",
    a: "岩皮餅"
  },
  {
    q: "在反抗調查官恩不裡居過程中，衛斯理雙子是在什麼考試中放的煙火？",
    a: "O.W.L.魔咒理論考試"
  },
  {
    q: "莉莉‧伊凡的護法和以下誰的一樣？",
    a: "石內卜‧賽佛勒斯"
  },
  {
    q: "石內卜教授的第一節魔藥學指導調製的藥劑是？",
    a: "治療疥瘡"
  },
  {
    q: "妙麗提問密室時，丙斯教授在講解哪年的國際巫師大會？",
    a: "一二八九年 (1289)"
  },
  {
    q: "哈利‧波特的傷疤在他身體的哪個部位？",
    a: "右額"
  },
  {
    q: "哈利和妙麗第一次穿梭時空在哪裡？",
    a: "校醫院"
  },
  {
    q: "霍格華茲史上最不受歡迎的校長是以下哪位？",
    a: "菲尼亞斯‧布萊克"
  },
  {
    q: "紐特曾在什麼地方發現奇獸騶吾？",
    a: "大街"
  },
  {
    q: "家養綠仙多比所穿的衣服是？",
    a: "枕套"
  },
  {
    q: "霍格華茲校門口的兩個石像是什麼？",
    a: "帶有翅膀的野豬"
  },
  {
    q: "1918年，紐特‧斯卡曼德受哪家公司委託撰寫了怪獸與牠們的產地？",
    a: "闇黑怨靈/默默然 圖書公司"
  },
  {
    q: "差點沒頭的尼克一直想加入哪個組織？",
    a: "無頭騎士狩獵"
  },
  {
    q: "小巴蒂‧克勞奇的標誌性動作是什麼",
    a: "吐舌頭"
  },
  {
    q: "大家熟知的奇獸動物園位於哪裡？",
    a: "斜角巷"
  },
  {
    q: "哈利‧波特的小兒子阿不思‧賽佛勒斯‧波特被分到了哪個學院？",
    a: "史萊哲林"
  },
  {
    q: "榮恩·衛斯理的貓頭鷹小豬原來叫什麽名字？",
    a: "朱薇瓊"
  },
  {
    q: "石內卜教授童年生活的地方是？",
    a: "紡紗街"
  },
  {
    q: "按住魂拚柳的什麼部位，它會靜止不動？",
    a: "樹幹上的節疤"
  },
  {
    q: "誰曾用賽佛勒斯‧石內卜的魔咒倒倒吊來對付他自己？",
    a: "詹姆‧波特"
  },
  {
    q: "誰在二年級時折斷了自己的魔杖？",
    a: "榮恩‧衛斯理"
  },
  {
    q: "進入赫夫帕夫交誼廳需要敲擊哪個木桶？",
    a: "第二排中間第二個桶"
  },
  {
    q: "吉德羅‧洛哈教授的秘密抱負是什麼？",
    a: "銷售自己的美髮產品"
  },
  {
    q: "波特家族發明了什麼魔藥？",
    a: "生骨藥"
  },
  {
    q: "歷史上，妙麗‧格蘭傑第一次製作變身水時錯誤使用了哪種生物的毛髮？",
    a: "貓"
  },
  {
    q: "露娜‧羅古德的媽媽去世的原因是？",
    a: "做實驗遇到了意外"
  },
  {
    q: "哈利‧波特17歲生日時，衛斯理夫人送了他什麼禮物？",
    a: "手錶"
  },
  {
    q: "哈利‧波特被食死人抓到馬份莊園時，用的是誰的名字？",
    a: "弗農‧達利"
  },
  {
    q: "哈利‧波特的姨丈在什麼公司上班？",
    a: "鑽機"
  },
  {
    q: "獅子阿爾發‧布萊克死後變成了什麼?",
    a: "行屍"
  },
  {
    q: "下列哪個家族不住在奧特裡‧聖卡奇波爾村附近？",
    a: "隆巴頓家"
  },
  {
    q: "關於現影術的三個「D」，不包括下列哪個：",
    a: "維度"
  },
  {
    q: "是什麼奇獸啟蒙了紐特‧斯卡曼德？",
    a: "紐特媽媽養的鷹馬"
  },
  {
    q: "阿波佛‧鄧不利多曾被控告對什麼動物濫施魔法？",
    a: "山羊"
  },
  {
    q: "哈利‧波特的室友西莫喜歡哪項運動？",
    a: "足球"
  },
  {
    q: "跩哥‧馬份的魔杖材質是什麼？",
    a: "山楂木"
  },
  {
    q: "在1996年神祕事務司大戰中，妙麗被哪個食死人重傷並且差點死掉？",
    a: "安東寧‧杜魯哈"
  },
  {
    q: "一年級三人組前往保護魔法石時，是誰攔住了他們？",
    a: "奈威‧隆巴頓"
  },
  {
    q: "維克多教授在霍格華茲教哪一門課程？",
    a: "算數占卜"
  },
  {
    q: "波巴洞魔法學校參加三巫鬥法大賽時乘坐哪種交通工具？",
    a: "神符天馬馬車"
  },
  {
    q: "妙麗·格蘭傑與哈利·波特見面時，使用的第一個咒語是？",
    a: "復復修"
  },
  {
    q: "哈利的姨丈最喜歡周幾？",
    a: "周日"
  },
  {
    q: "1979年誰向阿不思做了一個具有打敗佛地魔能力的孩子會出生的預言？",
    a: "西比爾‧崔老妮"
  },
  {
    q: "一飲活死水的配方中有以下哪種材料？",
    a: "水仙球根粉末"
  },
  {
    q: "雛菊根、無花果皮、毛毛蟲、水蛭汁、老鼠脾臟可以做什麼魔藥？",
    a: "縮骨藥水"
  },
  {
    q: "犄角獸可以在哪裡被發現？",
    a: "瑞典"
  },
  {
    q: "跩哥·馬份最終與誰結為了夫妻？",
    a: "阿斯托利亞·格林格拉斯"
  },
  {
    q: "試圖和榮恩立不破誓誓言，被打得左半拉屁股從此不一樣的是誰？",
    a: "弗雷"
  },
  {
    q: "用乾酪製作大釜的巫師是誰?",
    a: "韓弗理‧貝爾切"
  },
  {
    q: "雷文克勞的冠冕是被下列哪個咒語摧毀的？",
    a: "惡魔之火咒"
  },
  {
    q: "妙麗‧格蘭傑在聞到愛情藥劑後在腦海裡最後的味道是？",
    a: "牙膏"
  },
  {
    q: "榮恩在火車上第一次嘗試給哈利‧波特展示的咒語是？",
    a: "雛菊、甜奶油和陽光"
  },
  {
    q: "吉德羅‧洛哈榮獲多少次《女巫周刊》最迷人微笑獎？",
    a: "五次"
  },
  {
    q: "慈恩‧波八吉教授在霍格華茲教哪一門課程？",
    a: "麻瓜研究"
  },
  {
    q: "跩哥‧馬份在修理消失櫥櫃時，高爾等人用摔掉什麼來提醒他有人靠近？",
    a: "天平"
  },
  {
    q: "哈利曾經使用誘餌炸彈在魔法部的哪個辦公室門口引起了騷亂？",
    a: "麻瓜出身登記委員會主任辦公室"
  },
  {
    q: "規模最大的魔法學校是哪所？",
    a: "哇嘎度"
  },
  {
    q: "哈利將誰的襪子夾在書裡被魯休斯‧馬份送給了多比？",
    a: "哈利‧波特"
  },
  {
    q: "混血王子在他的魔藥學本上曾提出瞌睡豆如何處理更容易出汁？",
    a: "用銀短刀的側面擠壓"
  },
  {
    q: "派西‧衛斯理曾在舊雜貨舖裡閱讀什麼書？",
    a: "《級長怎樣獲得權力》"
  },
  {
    q: "金妮‧衛斯理的護法是什麼動物？",
    a: "馬"
  },
  {
    q: "誰在魔法部出口抓住了妙麗並進入了古裡某街十二號的門口？",
    a: "牙克厲"
  },
  {
    q: "被蛇妖殺死的女孩是誰？",
    a: "麥朵‧伊莉莎白‧華倫"
  },
  {
    q: "德思禮夫婦在哈利去霍格華茲的第一年聖誕，送了什麼禮物給哈利？",
    a: "五十便士"
  },
  {
    q: "霍格華茲城堡有些樓梯每逢周幾會通向不同的地方？",
    a: "週五"
  },
  {
    q: "多比沒有用什麼手段阻止哈利返校？",
    a: "囚禁哈利波特"
  },
  {
    q: "下列哪個不是哈利‧波特在魔藥學上聞意亂情迷水時聞到的味道？",
    a: "雨後的泥土"
  },
  {
    q: "以下哪種魔藥材料是在月光下的禁忌森林中才能採集到的？",
    a: "流液草"
  },
  {
    q: "霍格華茲通往活米村隱密通道的密語是什麼？",
    a: "左右分離"
  },
  {
    q: "哈利、榮恩和妙麗最喜歡到豬頭酒吧喝的飲品是？",
    a: "奶油啤酒"
  },
  {
    q: "誰在湖中心盛滿藥水的盆中藏了假小金匣？",
    a: "獅子阿爾發‧布萊克"
  },
  {
    q: "哈利‧波特17歲/十七歲生日時魯霸‧海格送了什麼禮物？",
    a: "驢皮做的小袋子"
  },
  {
    q: "哪所魔法學校只招收純血巫師？",
    a: "德姆斯特朗魔法學校"
  },
  {
    q: "在鄧不利多年輕時，曾不幸吃到哪個味道的比比多味豆？",
    a: "嘔吐物味"
  },
  {
    q: "露娜‧羅古德的丈夫是誰？",
    a: "羅夫‧斯卡曼德"
  },
  {
    q: "誰曾經被魯霸‧海格釋過變形咒？",
    a: "達力‧德思禮"
  },
  {
    q: "促使哈利，榮恩和妙麗成為好友的事件是？",
    a: "萬聖節山怪事件"
  },
  {
    q: "「雕像，行行起」咒語的正確拼寫是？",
    a: "Piertotum Locomotor"
  },
  {
    q: "在馬份莊園，貝拉‧雷斯壯在妙麗‧格蘭傑的手臂上寫了什麼？",
    a: "麻種"
  },
  {
    q: "霍格華茲的幽靈教授丙斯教授是在哪裡去世的？",
    a: "休息室的沙發上"
  },
  {
    q: "哈利‧波特二年級時無法進入九又四分之三車站是因為誰？",
    a: "家庭小精靈多比 / 綠仙多比"
  },
  {
    q: "在葛林戴華德的集會上，紐特‧斯卡曼德的哪只奇獸偷走了血盟？",
    a: "玻璃獸"
  },
  {
    q: "葛來分多交誼廳曾經使用過哪些密語？",
    a: "豬鼻子"
  },
  {
    q: "一段往事，誰奪走了灰女士的性命？",
    a: "血腥男爵"
  },
  {
    q: "第一屆魁地奇世界盃是什麼時候舉辦的？",
    a: "西元1473年"
  },
  {
    q: "張秋曾經使用過什麼貓頭鷹給自己的母親寄去生日禮物？",
    a: "草鴞"
  },
  {
    q: "哈利的孩子有幾個？",
    a: "3"
  },
  {
    q: "哈利‧波特第一次遇見催狂魔是在哪裡？",
    a: "霍格華茲特快車"
  },
  {
    q: "《哈利波特與密室》中沒被蛇妖石化的是誰？",
    a: "愛哭鬼麥朵"
  },
  {
    q: "哈利‧波特和榮恩一家觀看了哪一屆魁地奇世界盃賽？",
    a: "第422屆"
  },
  {
    q: "魁地奇比賽中，一個像足球那麼大，追蹤手們互相傳遞設法把它穿過對方的圓環的球是什麼？",
    a: "快浮"
  },
  {
    q: "布萊克家族大部分成員的名字是根據什麼來命名的？",
    a: "恆星或星座"
  },
  {
    q: "因為蛇妖而喪生的女孩是誰？",
    a: "麥朵‧伊莉莎白‧華倫"
  },
  {
    q: "金妮是在施什麼咒語時受到了史拉轟教授的關注，被邀請到了史拉俱樂部？",
    a: "蝙蝠精咒"
  },
  {
    q: "露娜·羅古德曾屬於哪個學院？",
    a: "雷文克勞"
  },
  {
    q: "哪一位人物沒有在莫莉‧衛斯理的幻形怪中出現過？",
    a: "妙麗‧格蘭傑"
  },
  {
    q: "使用鳳凰羽毛作為杖芯的魔杖的特性是什麼？",
    a: "擅長最多樣的魔法"
  },
  {
    q: "阿茲卡班建造在哪裡？",
    a: "北海中央"
  },
  {
    q: "衛斯理家是如何處理花園中的地精的？",
    a: "甩暈並扔到遠處"
  },
  {
    q: "正氣師考試中，小仙女‧東施最擅長的是哪一項？",
    a: "隱藏和偽裝"
  },
  {
    q: "歷史上誰發明了自動攪拌大釜？",
    a: "格斯帕德‧辛格頓"
  },
  {
    q: "火蜥蜴在古代神秘文字中代表什麼？",
    a: "數字6"
  },
  {
    q: "美國魔法國會的首任主席是誰？",
    a: "約西亞‧傑克森"
  },
  {
    q: "下列哪位巫師沒有收到過咆哮信？",
    a: "跩哥‧馬份"
  },
  {
    q: "歷史上，誰在學校修建了藏有蛇妖的密室，只為了清除學校裡的非純血巫師？",
    a: "薩拉札‧史萊哲林"
  },
  {
    q: "哈利上三年級前，在暑假收到了榮恩送的什麼禮物？",
    a: "袖珍測奸器"
  },
  {
    q: "哈利四年級的三巫鬥法大賽的最後一關中，第一個被淘汰的是？",
    a: "花兒‧戴樂古"
  },
  {
    q: "白鮮和什麼的混合物可以治療狼人咬傷？",
    a: "銀粉"
  },
  {
    q: "以下伊法魔尼四大學院創始人中哪一位是麻瓜？",
    a: "詹姆斯‧史都華"
  },
  {
    q: "誰曾在NEWTs中親自考阿不思‧鄧不利多的變形學和魔咒學？",
    a: "溫順‧馬治邦"
  },
  {
    q: "海格是怎麼得到火龍蛋的？",
    a: "贏來的"
  },
  {
    q: "隆巴頓教授的祖母的名字是什麼？",
    a: "奧古斯塔"
  },
  {
    q: "一六一二年妖精叛亂事件總部所在地是？",
    a: "豬頭酒吧"
  },
  {
    q: "1612年妖精叛亂事件總部所在地是？",
    a: "豬頭酒吧"
  },
  {
    q: "佛地魔的哪個分靈體被藏在古靈閣萊斯特蘭奇倉庫？",
    a: "海加‧赫夫帕夫的金杯"
  },
  {
    q: "奧利凡德在給哈利‧波特介紹魔杖時，提到誰的魔杖用於變形術最好不過？",
    a: "詹姆‧波特"
  },
  {
    q: "露娜的父親曾經邀請哈利喝什麼飲料？",
    a: "戈迪根茶"
  },
  {
    q: "賽佛勒斯·石內卜擔任校長時，誰是史萊哲林院長？",
    a: "赫瑞司·史拉轟"
  },
  {
    q: "榮恩‧衛斯理的哥哥曾把什麼變成大蜘蛛嚇到了榮恩？",
    a: "泰迪熊玩具"
  },
  {
    q: "「哈利是我們最大的希望，相信他」這句話出自誰？",
    a: "阿不思‧鄧不利多"
  },
  {
    q: "是誰發明了縛狼汁？",
    a: "達摩克‧貝爾比"
  },
  {
    q: "閃閃原先是誰的家庭小精靈？",
    a: "巴蒂‧克勞奇"
  },
  {
    q: "誰曾經被判在阿茲卡班中囚禁半年？",
    a: "史特吉‧包莫"
  },
  {
    q: "阿不思‧鄧不利多和哈利‧波特去岩洞中取小金匣時最想喝什麼？",
    a: "水"
  },
  {
    q: "歷史上第一位女性英國魔法部部長是？",
    a: "雅特米西亞‧勒夫金"
  },
  {
    q: "哈利‧波特被恩不裡居懲罰抄寫時用的墨水是？",
    a: "自己的血"
  },
  {
    q: "麻瓜在靠近施展了麻瓜驅逐咒的地點時會發生什麼？",
    a: "想起十萬火急的事情匆匆離開"
  },
  {
    q: "是誰曾經在暑假輔導過哈利魔法史作業？",
    a: "伏林‧伏德秋"
  },
  {
    q: "是哪位教授清理了衛斯理雙胞胎在學校留下的可攜式沼澤？",
    a: "孚立維教授"
  },
  {
    q: "拿樂絲太太是透過什麼看見了蛇妖？",
    a: "走廊裡地面的水"
  },
  {
    q: "哈利‧波特是誰的後裔？",
    a: "伊諾特‧皮福雷"
  },
  {
    q: "哈利四年級時參加的三巫鬥法大賽的獎金是多少？",
    a: "一千加隆 1000"
  },
  {
    q: "天狼星繼承的遺產來自於誰？",
    a: "阿法‧布萊克"
  },
  {
    q: "哈利‧波特的魔杖弄壞和誰有關？",
    a: "娜吉妮"
  },
  {
    q: "在日本最受推崇的魔杖是由什麼木材製成的？",
    a: "櫻桃木"
  },
  {
    q: "金妮曾開玩笑說過榮恩的身上紋了什麼動物？",
    a: "迷你毛毛球"
  },
  {
    q: "關於哈利‧波特的預言球在神秘部門的第幾排？",
    a: "第97排"
  },
  {
    q: "哈利第一次去摩金夫人長袍專賣店遇到了誰？",
    a: "跩哥‧馬份"
  },
  {
    q: "哈利‧波特第一次見到小仙女‧東施時，她的頭髮是什麼顏色？",
    a: "紫羅蘭色"
  },
  {
    q: "哈利‧波特的好友露娜‧羅古德的家裡種的是什麼神奇植物？",
    a: "馭心梅"
  },
  {
    q: "下列誰曾經擔任過赫夫帕夫的級長？",
    a: "阿尼‧麥米蘭"
  },
  {
    q: " 《魔法防禦理論》的作者是誰？",
    a: "威爾伯特‧斯林卡"
  },
  {
    q: "以下哪個不是衛氏巫師法寶店的獨家產品?",
    a: "吹寶超級泡泡糖 "
  },
  {
    q: "佛地魔從誰那裡得知小巴堤‧柯羅奇還活著？",
    a: "柏莎‧喬金"
  },
  {
    q: "減肥水果",
    a: "葡萄柚"
  },
  {
    q: "鄧不利多曾經警告湯姆‧瑞斗不得在霍格華茲做什麼事？",
    a: "偷竊"
  },
  {
    q: "一般巫師家庭中家庭小精靈薪水是多少？",
    a: "沒有薪水"
  },
  {
    q: "以下哪一位能和哈利波特一樣看到騎士墜鬼馬呢？",
    a: "露娜‧羅古德"
  },
  {
    q: "跩哥‧馬份曾經在夜行巷想要購買什麼物品？",
    a: "光榮之手"
  },
  {
    q: "哈利‧波特飼養的貓頭鷹嘿美的眼睛是什麼顏色？",
    a: "琥珀色"
  },
  {
    q: "下列哪種奇獸並非分類為XXXX級？",
    a: "龍"
  },
  {
    q: "天狼星在古靈閣的金庫是幾號？",
    a: "711號"
  },
  {
    q: "預言家日報一份多少錢？",
    a: "1銅納特"
  },
  {
    q: "小惠音區搭騎士公車的車資？",
    a: "11銀西可"
  },
  {
    q: "衛斯理一家在預言家日報贏得多少錢？",
    a: "700金加隆"
  },
  {
    q: "石內卜當代課老師時，要大家翻到第幾頁？",
    a: "394頁"
  },
  {
    q: "魔法石的尼樂勒梅幾歲？",
    a: "665歲"
  },
  {
    q: "在旅行者和時空不被破壞的前提，時間旅行最長多久？",
    a: "5小時"
  },
  {
    q: "雷木思‧路平的兒子？",
    a: "泰迪"
  },
  {
    q: "茉莉‧衛斯理結婚前的舊姓？",
    a: "普瑞"
  },
  {
    q: "在騎士公車上哈利假冒了誰？",
    a: "奈威"
  },
  {
    q: "美國的魔法學校創始人誰是麻瓜？",
    a: "詹姆‧史都華"
  },
  {
    q: "誰在「波特觀察」中的代號是老將？",
    a: "雷木思‧路平"
  },
  {
    q: "薩拉札‧史萊哲林的魔杖現今被保存在哪所學校？",
    a: "伊法魔尼"
  },
  {
    q: "X級奇獸是什麼？",
    a: "惹人煩惱的"
  },
  {
    q: "以下哪一種魔藥是強效安眠藥？",
    a: "一飲活死水"
  },
  {
    q: "鄧不利多最喜歡的果醬口味？",
    a: "覆盆子果醬"
  },
  {
    q: "霍格華茲入學通知信上的封蠟是什麼顏色？",
    a: "紫色"
  },
  {
    q: "石內卜教授關哈利禁閉時曾經讓他處理過什麼魔藥材料？",
    a: "黏巴蟲"
  },
  {
    q: "路平毛茸茸的小問題曾被人誤會是什麼？",
    a: "養了一隻不聽話的兔子"
  },
  {
    q: "雙胞胎在榮恩小時候要他做什麼事導致莫利生氣？",
    a: "立下不破誓"
  },
  {
    q: "畫片中國煉金師？",
    a: "鄒衍"
  },
  {
    q: "哈利就學期間，誰曾經擔任過魁地奇解說員？",
    a: "露娜‧羅古德"
  },
  {
    q: "哈利波特第一次乘坐霍格華茲特快車時花了多少錢買零食？",
    a: "十一個銀西可和七枚銅納特"
  },
  {
    q: "衛斯理一家在預言家日報的抽獎中共計贏得了多少獎金？",
    a: "700加隆"
  },
  {
    q: "佛地魔的寵物娜吉妮的真實身分是什麼？",
    a: "血咒宿主"
  },
  {
    q: "在哈利四年級時他的表哥達利因為體重過重需要減肥，而減肥的早餐是什麼？",
    a: "葡萄柚"
  },
  {
    q: "是誰真正提出了「七個波特」的建議？",
    a: "賽佛勒斯‧石內卜"
  },
  {
    q: "請問哈利‧波特小兒子的教父是誰？",
    a: "奈威‧隆巴頓"
  },
  {
    q: "哪一種是最稀有的杖芯材料？",
    a: "鳳凰羽毛"
  },
  {
    q: "歐洲的巫師們什麼時候開始使用飛天掃帚？",
    a: "西元962年"
  },
  {
    q: "哈利‧波特在四年級聖誕收到了教父天狼星‧布萊克送的什麼禮物？",
    a: "一把輕便的削筆刀"
  },
  {
    q: "在對旅行者和時間本身都不造成任何可能的嚴重損害的前提下，時間旅行的最長期限約為？",
    a: "5小時"
  },
  {
    q: "因弗農姨父出言不遜，海格讓達利長出了什麼尾巴？",
    a: "豬尾巴"
  },
  {
    q: "是誰最先找到了史萊哲林的小金匣？",
    a: "獅子阿爾發・布萊克(雷古勒斯·布萊克)"
  },
  {
    q: "在「七個波特」大戰中，誰沒有喝下變身水變為哈利‧波特？",
    a: "雷木思‧路平"
  },
  {
    q: "哈利共收到幾次《對未成年巫師加以合理約束法》的警告？",
    a: "1"
  },
  {
    q: "哈利曾經假裝將福來福喜加進什麼飲料裡誤導榮恩喝下去？",
    a: "南瓜汁"
  },
  {
    q: "請問以下英國魔法部部長裡，誰的任職時間最長？",
    a: "法里斯‧史帕芬"
  },
  {
    q: "請問《預言家日報》一份多少錢？",
    a: "1納特"
  },
  {
    q: "是誰在巨型棋盤陣中擔任了城堡的角色？",
    a: "妙麗‧格蘭傑"
  },
  {
    q: "下列物品中哪種不是衛氏巫師法店的產品？",
    a: "酷酸果"
  },
  {
    q: "《初學者的變形指南》的作者是？",
    a: "埃默里克‧斯威齊"
  },
  {
    q: "用來學院計分的沙漏裡面裝的是什麼？",
    a: "寶石"
  },
  {
    q: "古里某街十二號由什麼咒語保護？",
    a: "忠實咒"
  },
]